{
  "backend/main.mo": "Motoko actor implementing a tic-tac-toe backend with game state logic including win detection, tie detection, and score counting. Exposes an `updateGameState` function that returns a `Features` record with field state, player characters, and points.",
  "feature_evidence.json": "Feature evidence report linking the 'hide timer toggle' fix (keeping timer state intact when toggling visibility) to `frontend/src/App.tsx` with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a pre-built reference for the project's frontend architecture and file purposes.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "HTML entry point for the TickTaskTime app, loading the Quicksand font from Google Fonts and mounting the React app via `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React app component that keeps all timer components always mounted using CSS `hidden` class (not conditional rendering) to prevent timer resets on visibility toggle, and wires together background, music, routing, alerts, and sound providers.",
  "frontend/src/branding.ts": "Single-export module providing the `APP_NAME` constant ('TickTaskTime') as the app's branding source of truth.",
  "frontend/src/features/alerts/alertSounds.ts": "Defines alert sound options (off, beep, chime, bell, custom) and provides a `playAlertSound` utility that safely plays built-in Web Audio API tones or custom/YouTube URLs without throwing errors.",
  "frontend/src/features/alerts/TimerAlertSettings.tsx": "Settings UI card for timer alerts, allowing users to enable/disable alerts, select a completion sound (built-in or custom), and preview the selected sound.",
  "frontend/src/features/alerts/TimerAlertsProvider.tsx": "React context provider managing timer alert state (enabled flag, selected sound) with localStorage persistence, and exposing `notifyCompletion` and `previewSound` callbacks that play audio and show toast notifications.",
  "frontend/src/features/backgrounds/BackgroundCustomizer.tsx": "React component that renders a UI for setting the app background via file upload, direct URL, or YouTube URL, with controls for brightness, volume, and timer overlay toggle.",
  "frontend/src/features/backgrounds/BackgroundFullscreenButton.tsx": "Floating button component that toggles browser fullscreen mode on the background stage element, only rendered when an active background exists.",
  "frontend/src/features/backgrounds/BackgroundPlayButton.tsx": "Floating play/pause button rendered only when a video or YouTube background is active and not in fullscreen, delegating toggle logic to the background context.",
  "frontend/src/features/backgrounds/BackgroundProvider.tsx": "React context provider that wraps the `useBackground` hook, exposes background state and actions to child components, and handles blob URL cleanup on background changes.",
  "frontend/src/features/backgrounds/BackgroundStage.tsx": "Renders the active background (image, video, or YouTube) as a full-screen stage, managing play/pause via context state, spacebar keyboard shortcut, and error handling for each media type.",
  "frontend/src/features/backgrounds/loadYouTubeIFrameApi.ts": "Loads the YouTube IFrame Player API script once and returns a shared promise that resolves when the API is ready. Also declares global TypeScript types for the YT player interface.",
  "frontend/src/features/backgrounds/mediaSupport.ts": "Provides utility functions for inferring media type from MIME types or URLs, validating URLs, generating error messages, and probing whether a URL loads as an image or video.",
  "frontend/src/features/backgrounds/useBackground.ts": "Custom React hook that manages background state (image, video, or YouTube) with localStorage persistence, boot-time validation of persisted backgrounds, and controls for brightness, volume, and playback.",
  "frontend/src/features/backgrounds/YouTubeBackgroundPlayer.tsx": "Memoized component that loads the YouTube IFrame API and creates a looping, cover-fitted YouTube player for use as a background, responding to external `isPlaying` and `volume` props.",
  "frontend/src/features/backgrounds/youtubeUrl.ts": "Parses various YouTube URL formats to extract video IDs and builds optimized YouTube embed URLs with autoplay and loop parameters for background playback.",
  "frontend/src/features/music/MusicProvider.tsx": "React context provider that wraps the useMusic hook and exposes music state and controls (source, volume, playback error, etc.) to child components via useMusicContext.",
  "frontend/src/features/music/MusicSettings.tsx": "UI component for configuring music playback, allowing users to input a Spotify, Apple Music, or direct audio URL and adjust volume via a slider.",
  "frontend/src/features/music/MusicStage.tsx": "Renders the appropriate audio output element—a hidden audio tag for direct audio, or off-screen iframes for Spotify and Apple Music embeds—and manages direct audio playback lifecycle.",
  "frontend/src/features/music/musicSupport.ts": "Parses music URLs to classify them as Spotify, Apple Music, direct audio, or unknown, and converts share links into embeddable URLs for each supported service.",
  "frontend/src/features/music/useMusic.ts": "Custom React hook that manages music playback state (source URL, type, embed URL, volume) with localStorage persistence and an audio element ref for direct audio control.",
  "frontend/src/features/navigation/NavigationTabOrderSettings.tsx": "Settings UI component that displays instructions for drag-to-reorder navigation tabs and provides a button to reset the tab order to default.",
  "frontend/src/features/navigation/navigationTabs.ts": "Defines the NavigationTabId type, tab definitions, default order array, and a helper to get a tab's label by ID.",
  "frontend/src/features/navigation/ReorderableNavigationTabs.tsx": "Navigation tab bar component that supports pointer-based drag-and-drop reordering via a grip handle, updating tab order on drop.",
  "frontend/src/features/navigation/useNavigationTabOrder.ts": "Custom hook that loads, persists, and normalizes the navigation tab order from localStorage, with a reset function to restore the default order.",
  "frontend/src/features/publishShare/PublishShareSheet.tsx": "Sheet component that displays the current URL for sharing, with copy-to-clipboard and open-in-new-tab actions, and a warning when running inside an embedded preview iframe.",
  "frontend/src/features/publishShare/useIsEmbeddedPreview.ts": "Hook that detects whether the app is running inside an iframe by comparing window.self to window.top, returning a boolean.",
  "frontend/src/features/reminders/RemindersDueNotifier.tsx": "Headless component that polls reminders every 10 seconds and triggers a notification via the alerts system when a reminder's due date has passed.",
  "frontend/src/features/reminders/RemindersView.tsx": "UI component for managing reminders, providing dialogs to add and edit reminders with a title and datetime, and displaying them sorted by due date with delete and edit actions.",
  "frontend/src/features/reminders/useReminders.ts": "Custom hook that manages a list of reminders in localStorage, exposing add, update, and delete operations.",
  "frontend/src/features/sounds/CustomSoundsProvider.tsx": "React context provider that manages custom sounds state, persisting to localStorage and exposing methods to add (via URL or file upload), update, remove, reorder, and preview sounds.",
  "frontend/src/features/sounds/customSoundsStorage.ts": "Utility module for persisting custom sounds to localStorage with size/count validation, and helpers for generating IDs, converting files to data URLs, and validating audio file types.",
  "frontend/src/features/sounds/SoundCustomizationPanel.tsx": "UI panel component for managing custom sounds, supporting add/edit/delete via URL or file upload, drag-and-drop reordering, and preview playback.",
  "frontend/src/features/sounds/useSoundPanelVisibility.ts": "Custom hook that persists and toggles the sound panel's visibility state in localStorage.",
  "frontend/src/features/sounds/youtubeSoundPlayer.ts": "Module that plays audio from YouTube URLs using the IFrame API in a hidden player, with auto-stop after a configurable duration and full cleanup on stop.",
  "frontend/src/features/timers/countdown/CountdownTimer.tsx": "Countdown timer card component with editable hours/minutes/seconds inputs, play/pause/reset controls, and completion notification via TimerAlertsProvider.",
  "frontend/src/features/timers/countdown/useCountdown.ts": "Custom hook managing countdown timer state (duration, time left, running status) with accurate interval ticking, pause/resume support, localStorage persistence of duration, and an onComplete callback.",
  "frontend/src/features/timers/interval/IntervalTimer.tsx": "React component rendering an interval timer card with work/rest display, play/pause/reset/skip controls, and configurable settings for interval durations and rounds.",
  "frontend/src/features/timers/interval/useIntervalTimer.ts": "Custom hook managing interval timer state (work/rest intervals, rounds, countdown) with localStorage persistence, accurate tick logic, and start/pause/reset/skip controls.",
  "frontend/src/features/timers/navigation/ReorderableTimerTabs.tsx": "React component providing drag-and-drop reorderable timer navigation tabs using pointer events, with visual offset animations during dragging.",
  "frontend/src/features/timers/navigation/timerModes.ts": "Defines the list of available timer modes with their IDs and labels, the default tab order, and a helper to look up a mode's label by ID.",
  "frontend/src/features/timers/navigation/TimerTabOrderSettings.tsx": "Small settings UI component that displays instructions for reordering timer tabs and provides a button to reset the tab order to default.",
  "frontend/src/features/timers/navigation/useTimerTabOrder.ts": "Custom hook that loads, persists, and normalizes the timer tab order from localStorage, with deduplication and missing-mode backfill logic.",
  "frontend/src/features/timers/pomodoro/PomodoroTimer.tsx": "React component rendering a Pomodoro timer card with segment display, play/pause/reset/skip controls, and configurable work, short break, and long break durations.",
  "frontend/src/features/timers/pomodoro/usePomodoro.ts": "Custom hook managing Pomodoro timer state including work/break segments, completed pomodoro count, settings persistence in localStorage, and accurate countdown with skip logic.",
  "frontend/src/features/timers/repeating/RepeatingTimer.tsx": "React component rendering a repeating timer card with play/pause/reset controls, a time display, completed repeat count, and settings for duration and repeat count (including infinite mode).",
  "frontend/src/features/timers/repeating/useRepeatingTimer.ts": "Custom hook managing repeating timer state (countdown, repeat cycles, infinite mode) with localStorage persistence, accurate interval ticking, and start/pause/reset controls.",
  "frontend/src/features/timers/shared/AnimatedDialRing.tsx": "SVG component that renders two animated concentric arc rings representing seconds (outer) and minutes (inner) progress, with tick marks and a moving dot indicator.",
  "frontend/src/features/timers/shared/EditableNumberInput.tsx": "Controlled numeric text input component that allows direct editing, clamps values to min/max on blur, and syncs with external value changes when not focused.",
  "frontend/src/features/timers/shared/MinutesSecondsInput.tsx": "Composite input component that splits a total-seconds value into separate minutes and seconds EditableNumberInput fields, recombining them on change.",
  "frontend/src/features/timers/shared/RotaryDial.tsx": "Draggable rotary dial component that maps pointer/touch drag rotation to a numeric value within a min/max range, displaying the current value with a rotating indicator dot.",
  "frontend/src/features/timers/shared/timeFormat.ts": "Utility functions for formatting a total-seconds value into HH:MM:SS or MM:SS strings, and milliseconds into a similar format with centisecond precision.",
  "frontend/src/features/timers/shared/useAccurateInterval.ts": "Custom hook that sets up a setInterval with a stable callback ref, running only when the `running` flag is true and cleaning up on stop or unmount.",
  "frontend/src/features/timers/stopwatch/StopwatchTimer.tsx": "React component rendering a stopwatch UI card with start/pause, reset, and lap recording controls, displaying elapsed time and a scrollable lap history.",
  "frontend/src/features/timers/stopwatch/useStopwatch.ts": "Custom hook managing stopwatch state (elapsed time, running status, laps) with start, pause, reset, and lap recording logic using an accurate interval.",
  "frontend/src/features/timers/visibility/TimerVisibilityBar.tsx": "Fixed bottom toolbar component showing a wall clock and toggle controls for timer visibility, music, alerts, and settings/share dialogs.",
  "frontend/src/features/timers/visibility/TopLeftClock.tsx": "Fixed top-left clock display that shows the current time and hides itself when an active background (image, video, or YouTube) is set.",
  "frontend/src/features/timers/visibility/useTimerVisibility.ts": "Custom hook managing timer and toggle visibility state with localStorage/sessionStorage persistence, and auto-hiding the timer when a background becomes active.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining light/dark theme CSS custom properties (OKLCH color tokens) and utility classes for drag animations and drop targets.",
  "frontend/src/lib/safeStorage.ts": "Utility module wrapping localStorage and sessionStorage with error handling and an in-memory fallback for restricted environments like iframes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, custom theme tokens (colors via oklch CSS variables, fonts, border radius, box shadow, animations), and plugins for animation and typography.",
  "project_state.json": "Project state metadata tracking version, existing features, and a known issue where clicking the 'hide timer' toggle incorrectly restarts the timer instead of only hiding its visual display."
}