{
  "backend/main.mo": "Motoko actor implementing a tic-tac-toe backend with game state logic including win detection, tie detection, and score counting. Exposes an `updateGameState` function that returns a `Features` record with field state, player characters, and points.",
  "feature_evidence.json": "Feature evidence report listing two planned features: adding a 'ping' alert sound via Web Audio API in `alertSounds.ts`, and adding a volume control slider to `SoundCustomizationPanel` with localStorage persistence via `CustomSoundsProvider`.",
  "frontend-file-summaries.txt": "Truncated JSON document containing short summaries of frontend source files, describing each file's purpose and notable implementation details for the timer app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the React app, loading the Quicksand font from Google Fonts and mounting the app at `#root` via `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React component that composes all providers (query, router, background, music, alerts, sounds), renders the stable media layer, timer overlay, and reorderable timer tabs with visibility controls and an error boundary.",
  "frontend/src/branding.ts": "Single-export module providing the `APP_NAME` constant ('TickTaskTime') as the app's branding source of truth.",
  "frontend/src/features/alerts/alertSounds.ts": "Defines available alert sound options and provides a `playAlertSound` utility that plays built-in tones (beep, chime, bell, ping) via the Web Audio API or custom/YouTube sounds via URL.",
  "frontend/src/features/alerts/TimerAlertSettings.tsx": "Settings card UI component for timer alerts, allowing users to toggle alerts on/off, select a completion sound (built-in or custom), and preview the selected sound.",
  "frontend/src/features/alerts/TimerAlertsProvider.tsx": "React context provider managing timer alert state (enabled toggle, selected sound) with localStorage persistence, and exposing `notifyCompletion` and `previewSound` callbacks that invoke `playAlertSound`.",
  "frontend/src/features/backgrounds/BackgroundCustomizer.tsx": "React component that renders a UI for setting the app background via file upload, direct URL, or YouTube URL, with controls for brightness, volume, and timer overlay toggle.",
  "frontend/src/features/backgrounds/BackgroundFullscreenButton.tsx": "Floating button component that toggles browser fullscreen mode on the background stage element, only rendered when a background is active.",
  "frontend/src/features/backgrounds/BackgroundPlayButton.tsx": "Floating play/pause button rendered only when a video or YouTube background is active and not in fullscreen, delegating toggle logic to the background context.",
  "frontend/src/features/backgrounds/BackgroundProvider.tsx": "React context provider that wraps the `useBackground` hook and exposes background state and actions to child components, while also managing blob URL cleanup.",
  "frontend/src/features/backgrounds/BackgroundStage.tsx": "Renders the active background (image, video, or YouTube) as a full-screen stage element, handling play/pause control, error states, and spacebar keyboard shortcut.",
  "frontend/src/features/backgrounds/loadYouTubeIFrameApi.ts": "Loads the YouTube IFrame Player API script once and returns a shared promise that resolves when the API is ready. Also declares global TypeScript types for the YT player interface.",
  "frontend/src/features/backgrounds/mediaSupport.ts": "Provides utility functions for inferring media type from MIME types or URLs, validating URLs, generating error messages, and probing whether a URL loads as an image or video.",
  "frontend/src/features/backgrounds/useBackground.ts": "Custom React hook that manages background state (image, video, or YouTube) with localStorage persistence, boot-time validation of persisted backgrounds, and controls for brightness, volume, and playback.",
  "frontend/src/features/backgrounds/YouTubeBackgroundPlayer.tsx": "Memoized component that initializes and manages a YouTube IFrame player sized to cover the viewport, supporting play/pause and volume control via the YT API.",
  "frontend/src/features/backgrounds/youtubeUrl.ts": "Parses various YouTube URL formats to extract video IDs and builds optimized YouTube embed URLs with autoplay, loop, and IFrame API parameters.",
  "frontend/src/features/music/MusicProvider.tsx": "React context provider that exposes the useMusic hook's state and actions (source URL, type, volume, controls) to the component tree via MusicContext.",
  "frontend/src/features/music/MusicSettings.tsx": "UI component for configuring music playback, allowing users to input a Spotify, Apple Music, or direct audio URL and adjust volume via a slider.",
  "frontend/src/features/music/MusicStage.tsx": "Renders the appropriate audio output element—a hidden HTML audio element for direct audio, or off-screen iframes for Spotify and Apple Music embeds—and manages direct audio playback lifecycle.",
  "frontend/src/features/music/musicSupport.ts": "Parses music URLs to classify them as Spotify, Apple Music, direct audio, or unknown, and converts share links into embeddable URLs.",
  "frontend/src/features/music/useMusic.ts": "Custom React hook that manages music playback state (source URL, type, embed URL, volume) with localStorage persistence and an audio element ref for direct audio control.",
  "frontend/src/features/navigation/NavigationTabOrderSettings.tsx": "Settings UI component that displays instructions for drag-reordering navigation tabs and provides a button to reset the tab order to its default.",
  "frontend/src/features/navigation/navigationTabs.ts": "Defines the NavigationTabId type, tab definitions, default order array, and a helper to look up a tab's label by ID.",
  "frontend/src/features/navigation/ReorderableNavigationTabs.tsx": "Navigation tab bar component that supports pointer-based drag-and-drop reordering via grip handles, updating the tab order on drop.",
  "frontend/src/features/navigation/useNavigationTabOrder.ts": "Custom hook that loads, persists, and normalizes the navigation tab order from localStorage, with a reset function to restore the default order.",
  "frontend/src/features/publishShare/PublishShareSheet.tsx": "Sheet component that displays the current URL for sharing, with copy-to-clipboard and open-in-new-tab actions, and a warning when running inside an embedded preview iframe.",
  "frontend/src/features/publishShare/useIsEmbeddedPreview.ts": "Hook that detects whether the app is running inside an iframe by comparing window.self to window.top, returning true if embedded.",
  "frontend/src/features/reminders/RemindersDueNotifier.tsx": "Background component that polls reminders every 10 seconds and triggers a notification via the alerts system when a reminder's due date has passed.",
  "frontend/src/features/reminders/RemindersView.tsx": "UI component for managing reminders, providing dialogs to add and edit reminders with a title and datetime, and a sorted list with delete and edit actions.",
  "frontend/src/features/reminders/useReminders.ts": "Custom hook that manages a list of reminders in localStorage, exposing add, update, and delete operations with stable callbacks.",
  "frontend/src/features/sounds/CustomSoundsProvider.tsx": "React context provider that manages custom sounds state, including adding/removing/reordering sounds via URL or file upload, volume control, and preview playback with localStorage persistence.",
  "frontend/src/features/sounds/customSoundsStorage.ts": "Utility module for loading, saving, and validating custom sounds in localStorage, with size/quota checks, ID generation, and audio file validation helpers.",
  "frontend/src/features/sounds/SoundCustomizationPanel.tsx": "UI panel component for managing custom sounds, offering add/edit/delete/reorder functionality via dialogs, drag-and-drop, and a volume slider.",
  "frontend/src/features/sounds/useSoundPanelVisibility.ts": "Custom hook that persists and toggles the sound panel's visibility state in localStorage.",
  "frontend/src/features/sounds/youtubeSoundPlayer.ts": "Module that plays audio from YouTube URLs using the IFrame API via a hidden player, with auto-stop after a configurable duration and cleanup utilities.",
  "frontend/src/features/timers/countdown/CountdownTimer.tsx": "Countdown timer UI card component with play/pause/reset controls and editable hours, minutes, and seconds duration inputs that triggers an alert on completion.",
  "frontend/src/features/timers/countdown/useCountdown.ts": "Custom hook implementing countdown timer logic with accurate interval tracking, pause/resume support, completion callback, and duration persistence in localStorage.",
  "frontend/src/features/timers/interval/IntervalTimer.tsx": "React component rendering an interval timer card with work/rest display, play/pause/reset/skip controls, and configurable settings for interval durations and rounds.",
  "frontend/src/features/timers/interval/useIntervalTimer.ts": "Custom hook managing interval timer state (work/rest intervals, rounds, countdown) with localStorage persistence, accurate tick logic, and start/pause/reset/skip controls.",
  "frontend/src/features/timers/navigation/ReorderableTimerTabs.tsx": "React component providing drag-and-drop reorderable timer navigation tabs using pointer events, with visual offset animations during dragging.",
  "frontend/src/features/timers/navigation/timerModes.ts": "Defines the available timer modes, their labels, default ordering, and a helper function to look up a mode's display label.",
  "frontend/src/features/timers/navigation/TimerTabOrderSettings.tsx": "Small settings UI component that displays instructions for reordering timer tabs and provides a button to reset the tab order to default.",
  "frontend/src/features/timers/navigation/useTimerTabOrder.ts": "Custom hook that loads, persists, and normalizes the timer tab order from localStorage, with deduplication and missing-mode handling.",
  "frontend/src/features/timers/pomodoro/PomodoroTimer.tsx": "React component rendering a Pomodoro timer card with segment display, play/pause/reset/skip controls, and configurable work/break durations and long-break interval.",
  "frontend/src/features/timers/pomodoro/usePomodoro.ts": "Custom hook managing Pomodoro timer state including work/short-break/long-break segments, completed pomodoro count, localStorage persistence, and accurate countdown logic.",
  "frontend/src/features/timers/repeating/RepeatingTimer.tsx": "React component rendering a repeating timer card with play/pause/reset controls, a time display, completed repeat count, and settings for duration and repeat count including an infinite mode toggle.",
  "frontend/src/features/timers/repeating/useRepeatingTimer.ts": "Custom hook managing repeating timer state (start, pause, reset, cycle counting) with localStorage persistence and an optional onComplete callback when all cycles finish.",
  "frontend/src/features/timers/shared/AnimatedDialRing.tsx": "SVG component rendering dual animated arc rings representing seconds (outer) and minutes (inner) progress, with tick marks and a moving dot indicator.",
  "frontend/src/features/timers/shared/EditableNumberInput.tsx": "Controlled numeric text input component that syncs with an external value, clamps input on blur, and supports keyboard confirmation and cancellation.",
  "frontend/src/features/timers/shared/MinutesSecondsInput.tsx": "Composite input component that splits a total-seconds value into separate minutes and seconds EditableNumberInput fields and recombines them on change.",
  "frontend/src/features/timers/shared/RotaryDial.tsx": "Draggable rotary dial component that maps pointer/touch rotation to a numeric value within a min/max range, displaying the current value with a rotating indicator dot.",
  "frontend/src/features/timers/shared/timeFormat.ts": "Utility functions to format a total-seconds value into HH:MM:SS or MM:SS strings, and milliseconds into a similar format with centisecond precision.",
  "frontend/src/features/timers/shared/useAccurateInterval.ts": "Custom hook that sets up a setInterval with a stable callback ref, only running when the `running` flag is true and cleaning up on stop or unmount.",
  "frontend/src/features/timers/stopwatch/StopwatchTimer.tsx": "React component rendering a stopwatch UI card with start/pause, reset, and lap recording controls, displaying elapsed time and a scrollable lap history.",
  "frontend/src/features/timers/stopwatch/useStopwatch.ts": "Custom hook managing stopwatch state (elapsed time, running status, laps) with start, pause, reset, and lap recording actions using an accurate interval.",
  "frontend/src/features/timers/visibility/TimerVisibilityBar.tsx": "Fixed bottom toolbar component showing a wall clock and toggle controls for timer visibility, music, alerts, settings, and sharing.",
  "frontend/src/features/timers/visibility/TopLeftClock.tsx": "Fixed top-left clock display that shows the current time and hides itself when an active background (image, video, or YouTube) is set.",
  "frontend/src/features/timers/visibility/useTimerVisibility.ts": "Custom hook managing timer visibility and two toggle states (music, alerts) with localStorage/sessionStorage persistence and auto-hide behavior when a background is active.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and custom hook.",
  "frontend/src/index.css": "Global CSS file configuring Tailwind base/components/utilities, defining light and dark theme CSS custom properties (OKLCH color tokens), and utility classes for drag animations.",
  "frontend/src/lib/safeStorage.ts": "Utility module wrapping localStorage and sessionStorage with error handling and an in-memory fallback for restricted environments like iframes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color tokens using oklch CSS variables, typography, border radius, box shadow, and accordion animations. Includes the tailwindcss-animate and @tailwindcss/typography plugins.",
  "project_state.json": "Project state metadata tracking two existing features (ping alarm sound via Web Audio API and volume control slider in the sound panel) and two pending action requests corresponding to those features."
}