{
  "backend/main.mo": "Motoko actor implementing a tic-tac-toe backend with game state logic including win detection, tie detection, and score counting. Exposes an `updateGameState` async function that returns a `Features` record with field state, player characters, and points.",
  "feature_evidence.json": "Feature evidence report documenting the fullscreen button feature, listing the files it touches, component dependencies, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "A JSON document containing short summaries of each frontend source file, describing their purpose and key implementation details for build planning reference.",
  "frontend/index.css": "Tailwind base CSS defining OKLCH-based design tokens for light and dark themes, including colors for background, foreground, card, sidebar, chart, and destructive states.",
  "frontend/index.html": "HTML entry point for the TickTaskTime app, loading the Quicksand font from Google Fonts and mounting the React app via `/src/main.tsx`.",
  "frontend/src/App.tsx": "Root React app component that composes all providers (query, router, alerts, sounds, music, backgrounds), renders the stable media layer, timer tabs, floating action buttons (play and fullscreen), and a settings panel. Includes an error boundary and a timer overlay for fullscreen mode.",
  "frontend/src/branding.ts": "Single-export module defining the `APP_NAME` constant as `'TickTaskTime'` for use across the app.",
  "frontend/src/features/alerts/alertSounds.ts": "Defines alert sound options (off, beep, chime, bell, custom) and provides a `playAlertSound` utility that uses the Web Audio API for built-in tones and supports custom URLs including YouTube links.",
  "frontend/src/features/alerts/TimerAlertSettings.tsx": "Settings card UI for timer alerts, allowing users to enable/disable alerts, select a completion sound (built-in or custom), and preview the selected sound.",
  "frontend/src/features/alerts/TimerAlertsProvider.tsx": "React context provider managing timer alert state (enabled flag, selected sound) with localStorage persistence, and exposing `notifyCompletion` and `previewSound` callbacks that play audio and show toast notifications.",
  "frontend/src/features/backgrounds/BackgroundCustomizer.tsx": "React component that provides a UI for setting a background via file upload, direct URL, or YouTube URL, with controls for brightness, volume, and timer overlay toggle.",
  "frontend/src/features/backgrounds/BackgroundFullscreenButton.tsx": "Floating button component that toggles browser fullscreen mode on the background stage element, only rendered when an active background exists.",
  "frontend/src/features/backgrounds/BackgroundPlayButton.tsx": "Floating play/pause button rendered only when a video or YouTube background is active and not in fullscreen, delegating toggle logic to the background context.",
  "frontend/src/features/backgrounds/BackgroundProvider.tsx": "React context provider that wraps the `useBackground` hook, exposes background state and actions to child components, and handles blob URL cleanup on background changes.",
  "frontend/src/features/backgrounds/BackgroundStage.tsx": "Renders the active background (image, video, or YouTube) as a full-screen stage, managing play/pause via context state, spacebar keyboard shortcut, and error handling for each media type.",
  "frontend/src/features/backgrounds/loadYouTubeIFrameApi.ts": "Loads the YouTube IFrame Player API script exactly once and returns a shared promise that resolves when the API is ready. Also declares global TypeScript types for the YT player interface.",
  "frontend/src/features/backgrounds/mediaSupport.ts": "Provides utility functions for inferring media type from MIME types or URLs, validating URLs, generating error messages, and probing whether a URL loads as an image or video.",
  "frontend/src/features/backgrounds/useBackground.ts": "Custom React hook that manages background state (image, video, or YouTube) including persistence to localStorage, boot-time validation of stored backgrounds, and controls for brightness, volume, and playback.",
  "frontend/src/features/backgrounds/YouTubeBackgroundPlayer.tsx": "Memoized component that initializes and manages a YouTube IFrame API player sized to cover the viewport, supporting play/pause control, volume adjustment, looping, and error reporting.",
  "frontend/src/features/backgrounds/youtubeUrl.ts": "Parses various YouTube URL formats to extract a video ID and builds an optimized YouTube embed URL with autoplay, loop, and JS API parameters for background playback.",
  "frontend/src/features/music/MusicProvider.tsx": "React context provider that exposes the useMusic hook's state and actions (source URL, type, volume, controls) to the component tree via useMusicContext.",
  "frontend/src/features/music/MusicSettings.tsx": "UI component for configuring music playback, allowing users to input a Spotify, Apple Music, or direct audio URL and adjust volume via a slider.",
  "frontend/src/features/music/MusicStage.tsx": "Renders the appropriate audio output element—a hidden HTML audio element for direct audio, or off-screen iframes for Spotify and Apple Music embeds—and manages audio playback lifecycle.",
  "frontend/src/features/music/musicSupport.ts": "Parses music URLs to classify them as Spotify, Apple Music, direct audio, or unknown, and converts share links into embeddable URLs for each supported service.",
  "frontend/src/features/music/useMusic.ts": "Custom React hook that manages music playback state (source URL, type, embed URL, volume) with localStorage persistence and an audio element ref for direct audio control.",
  "frontend/src/features/navigation/NavigationTabOrderSettings.tsx": "Settings UI component that displays instructions for drag-to-reorder navigation tabs and provides a button to reset the tab order to its default.",
  "frontend/src/features/navigation/navigationTabs.ts": "Defines the NavigationTabId type, tab definitions, default order array, and a helper to look up a tab's label by ID.",
  "frontend/src/features/navigation/ReorderableNavigationTabs.tsx": "Navigation tab bar component that supports pointer-based drag-and-drop reordering of tabs via a grip handle, updating the order on drop.",
  "frontend/src/features/navigation/useNavigationTabOrder.ts": "Custom hook that loads, persists, and exposes the navigation tab order from localStorage, with normalization to handle missing or duplicate entries.",
  "frontend/src/features/publishShare/PublishShareSheet.tsx": "Sheet component that displays the current URL for sharing, with copy-to-clipboard and open-in-new-tab actions, and a warning when running inside an embedded preview iframe.",
  "frontend/src/features/publishShare/useIsEmbeddedPreview.ts": "Hook that detects whether the app is running inside an iframe by comparing window.self to window.top, returning true if embedded.",
  "frontend/src/features/reminders/RemindersDueNotifier.tsx": "Headless component that polls reminders every 10 seconds and triggers a notification via the alerts system when a reminder's due date has passed.",
  "frontend/src/features/reminders/RemindersView.tsx": "UI component for managing reminders, providing dialogs to add and edit reminders with a title and datetime, and displaying them sorted by due date with delete and edit actions.",
  "frontend/src/features/reminders/useReminders.ts": "Custom hook that manages a list of reminders in localStorage, exposing add, update, and delete operations with stable callbacks.",
  "frontend/src/features/sounds/CustomSoundsProvider.tsx": "React context provider that manages custom sounds state, persisting to localStorage and exposing methods to add (by URL or file), update, remove, reorder, and preview sounds with toast notifications.",
  "frontend/src/features/sounds/customSoundsStorage.ts": "Utility module for persisting custom sounds to localStorage with size/count limits, plus helpers for ID generation, file-to-data-URL conversion, and audio file validation.",
  "frontend/src/features/sounds/SoundCustomizationPanel.tsx": "UI panel component for managing custom sounds, supporting add/edit/delete via dialogs, file upload or URL input, and drag-and-drop or button-based reordering.",
  "frontend/src/features/sounds/useSoundPanelVisibility.ts": "Custom hook that persists and toggles the sound panel's visibility state in localStorage.",
  "frontend/src/features/sounds/youtubeSoundPlayer.ts": "Module that plays audio from YouTube URLs using the IFrame API in a hidden player, with auto-stop after a configurable duration and full cleanup on stop.",
  "frontend/src/features/timers/countdown/CountdownTimer.tsx": "Countdown timer card component with editable hours/minutes/seconds inputs, play/pause/reset controls, and completion notification via TimerAlertsProvider.",
  "frontend/src/features/timers/countdown/useCountdown.ts": "Custom hook managing countdown timer state (duration, time left, running status) with accurate interval ticking, pause/resume support, localStorage persistence, and an onComplete callback.",
  "frontend/src/features/timers/interval/IntervalTimer.tsx": "React component rendering an interval timer card with work/rest display, play/pause/reset/skip controls, and configurable settings for interval durations and rounds.",
  "frontend/src/features/timers/interval/useIntervalTimer.ts": "Custom hook managing interval timer state (work/rest intervals, rounds, countdown) with localStorage persistence, accurate tick logic, and start/pause/reset/skip controls.",
  "frontend/src/features/timers/navigation/ReorderableTimerTabs.tsx": "React component providing drag-and-drop reorderable timer navigation tabs using pointer events, with animated tab shifting and click-vs-drag detection.",
  "frontend/src/features/timers/navigation/timerModes.ts": "Defines the list of available timer modes with their IDs and labels, the default tab order, and a helper to look up a mode's label by ID.",
  "frontend/src/features/timers/navigation/TimerTabOrderSettings.tsx": "Small settings UI component that displays instructions for reordering timer tabs and provides a button to reset the tab order to default.",
  "frontend/src/features/timers/navigation/useTimerTabOrder.ts": "Custom hook that loads, persists, and normalizes the timer tab order from localStorage, with deduplication and missing-mode backfill logic.",
  "frontend/src/features/timers/pomodoro/PomodoroTimer.tsx": "React component rendering a Pomodoro timer card with segment display, play/pause/reset/skip controls, and configurable work, short break, and long break durations.",
  "frontend/src/features/timers/pomodoro/usePomodoro.ts": "Custom hook managing Pomodoro timer state including work/break segment cycling, completed pomodoro count, localStorage persistence, and accurate countdown logic.",
  "frontend/src/features/timers/repeating/RepeatingTimer.tsx": "React component rendering a repeating timer card with play/pause/reset controls, a time display, completed repeat count, and settings for duration and repeat count including an infinite mode toggle.",
  "frontend/src/features/timers/repeating/useRepeatingTimer.ts": "Custom hook managing repeating timer state (start, pause, reset, cycle counting) with localStorage persistence and an optional onComplete callback when all cycles finish.",
  "frontend/src/features/timers/shared/AnimatedDialRing.tsx": "SVG component rendering two concentric animated arc rings representing seconds (outer) and minutes (inner) progress, with tick marks and a moving dot indicator.",
  "frontend/src/features/timers/shared/EditableNumberInput.tsx": "Controlled numeric text input component that syncs with an external value, clamps input on blur, and supports keyboard confirmation and cancellation.",
  "frontend/src/features/timers/shared/MinutesSecondsInput.tsx": "Composite input component that splits a total-seconds value into separate minutes and seconds EditableNumberInput fields and recombines them on change.",
  "frontend/src/features/timers/shared/RotaryDial.tsx": "Draggable rotary dial component that maps pointer/touch drag angle to a numeric value within a min/max range, displaying the current value with a rotating indicator dot.",
  "frontend/src/features/timers/shared/timeFormat.ts": "Utility functions to format a total-seconds value into HH:MM:SS or MM:SS strings, and milliseconds into a similar format with centisecond precision.",
  "frontend/src/features/timers/shared/useAccurateInterval.ts": "Custom hook that sets up a setInterval with a stable callback ref, only running when the `running` flag is true and clearing on cleanup.",
  "frontend/src/features/timers/stopwatch/StopwatchTimer.tsx": "React component rendering a stopwatch UI card with start/pause, reset, and lap recording controls, displaying elapsed time and a scrollable lap history.",
  "frontend/src/features/timers/stopwatch/useStopwatch.ts": "Custom hook managing stopwatch state (elapsed time, running status, laps) with start, pause, reset, and lap recording actions using an accurate interval.",
  "frontend/src/features/timers/visibility/TimerVisibilityBar.tsx": "Fixed bottom toolbar component displaying a wall clock and toggle controls for timer visibility, music, alerts, settings, and sharing.",
  "frontend/src/features/timers/visibility/TopLeftClock.tsx": "Fixed top-left clock component that displays the current time and hides itself when an active background (image, video, or YouTube) is set.",
  "frontend/src/features/timers/visibility/useTimerVisibility.ts": "Custom hook managing timer panel visibility and two toggle states (music, alerts), persisting values to localStorage/sessionStorage and auto-hiding the timer when a background is active.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and custom hook.",
  "frontend/src/index.css": "Global stylesheet configuring Tailwind base/components/utilities, defining light and dark CSS custom properties for the design system, and adding drag-animation utility classes.",
  "frontend/src/lib/safeStorage.ts": "Utility wrapping localStorage and sessionStorage with error handling and an in-memory fallback, exposing safe get, set, and remove operations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Quicksand), OKLCH-based color tokens, border radii, a glow box shadow, accordion animations, and enabling the tailwindcss-animate and @tailwindcss/typography plugins.",
  "project_state.json": "Tracks the current state of the TickTaskTime project at schema version 1.0.0, recording existing features (fullscreen button toggle) and a pending new feature request (AR-1) to add a fullscreen background button."
}