{
  "backend/main.mo": "Motoko actor implementing a tic-tac-toe game backend with helper functions for win detection, tie detection, and game state updates. Exposes an `updateGameState` async method that returns a `Features` record with field state, player characters, and points.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: applying the Settings panel's pink/crimson color theme consistently across toggles and buttons, and adding Spotify embed support to the music feature.",
  "frontend-file-summaries.txt": "Truncated JSON document containing one-sentence summaries of frontend source files, describing their roles in styling, timer logic, background handling, and UI components.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, sidebar, chart, and other design tokens.",
  "frontend/index.html": "HTML entry point for the React app, loading the Quicksand font from Google Fonts and mounting the app via `/src/main.tsx` into a `#root` div.",
  "frontend/src/App.tsx": "Root React component that wires together all providers (background, music, alerts, sounds, tasks), renders the stable media layer, timer tabs, visibility bar, tasks panel, and an error boundary. Manages active timer mode and tasks/sound panel visibility state.",
  "frontend/src/branding.ts": "Single-export module defining the app name constant `APP_NAME = 'TickTockTask'` as the branding source of truth.",
  "frontend/src/features/alerts/alertSounds.ts": "Defines available alert sound options and provides a `playAlertSound` utility that plays built-in synthesized tones (beep, chime, bell, ping) or custom/YouTube audio URLs using the Web Audio API.",
  "frontend/src/features/alerts/TimerAlertSettings.tsx": "Settings card component for timer alerts, providing a toggle to enable/disable alerts, a sound selector (including custom sounds), and a preview button using the `useTimerAlerts` and `useCustomSounds` hooks.",
  "frontend/src/features/alerts/TimerAlertsProvider.tsx": "React context provider that manages timer alert settings (enabled state, completion sound selection) with localStorage persistence, and exposes functions to notify completion with toast + sound and preview sounds.",
  "frontend/src/features/backgrounds/BackgroundCustomizer.tsx": "UI component with tabs for setting a background via file upload, direct URL, or YouTube URL, plus controls for brightness, volume, and timer overlay toggle.",
  "frontend/src/features/backgrounds/BackgroundFullscreenButton.tsx": "Fixed-position button that toggles browser fullscreen mode for the entire page, only rendered when an active background is set.",
  "frontend/src/features/backgrounds/BackgroundPlayButton.tsx": "Fixed-position play/pause button for video or YouTube backgrounds, hidden during fullscreen playback.",
  "frontend/src/features/backgrounds/BackgroundProvider.tsx": "React context provider wrapping the `useBackground` hook, managing blob URL cleanup and exposing background state and controls to child components.",
  "frontend/src/features/backgrounds/BackgroundStage.tsx": "Renders the active background (image, video, or YouTube player) with error handling, play/pause control, brightness overlay, and spacebar keyboard shortcut support.",
  "frontend/src/features/backgrounds/loadYouTubeIFrameApi.ts": "Loads the YouTube IFrame Player API script once (singleton promise) and exposes TypeScript type declarations for the YT global and YTPlayer interface.",
  "frontend/src/features/backgrounds/mediaSupport.ts": "Utility functions for inferring media type from MIME type or URL extension, validating URLs, probing whether a URL loads as image or video, and generating user-friendly error messages.",
  "frontend/src/features/backgrounds/useBackground.ts": "Custom hook that manages background state (image, video, or YouTube) with localStorage persistence, boot-time validation of persisted URLs, and handlers for setting/clearing the background and adjusting volume and brightness.",
  "frontend/src/features/backgrounds/YouTubeBackgroundPlayer.tsx": "A memoized React component that renders a YouTube video as a full-viewport background using the IFrame API, handling play/pause, volume, resizing, and error states.",
  "frontend/src/features/backgrounds/youtubeUrl.ts": "Parses various YouTube URL formats (watch, embed, youtu.be, mobile) to extract an 11-character video ID, and builds an optimized YouTube embed URL for background playback.",
  "frontend/src/features/music/MusicProvider.tsx": "React context provider that wraps the useMusic hook and exposes music state and controls (source, volume, error, audioRef) to child components via useMusicContext.",
  "frontend/src/features/music/MusicSettings.tsx": "UI settings panel for configuring music playback, allowing users to input a Spotify, Apple Music, or direct audio URL and adjust volume via a slider.",
  "frontend/src/features/music/MusicStage.tsx": "Memoized component that renders the appropriate audio output element—a hidden audio tag for direct audio, or off-screen iframes for Spotify and Apple Music embeds.",
  "frontend/src/features/music/musicSupport.ts": "Provides URL parsing utilities to classify music links as Spotify, Apple Music, direct audio, or unknown, and converts them to embeddable URLs.",
  "frontend/src/features/music/useMusic.ts": "React hook managing music playback state (source URL, type, embed URL, volume) with localStorage persistence and an audio element ref.",
  "frontend/src/features/navigation/NavigationTabOrderSettings.tsx": "Settings UI component that displays instructions for drag-reordering navigation tabs and provides a reset-to-default button.",
  "frontend/src/features/navigation/navigationTabs.ts": "Defines the NavigationTabId type, tab definitions, default order, and a helper to look up a tab's label by ID.",
  "frontend/src/features/navigation/ReorderableNavigationTabs.tsx": "Renders navigation tabs with pointer-event-based drag-and-drop reordering via a grip handle, updating the tab order on drop.",
  "frontend/src/features/navigation/useNavigationTabOrder.ts": "React hook that loads, persists, and normalizes the navigation tab order in localStorage, with a reset function.",
  "frontend/src/features/publishShare/PublishShareSheet.tsx": "Sheet component for sharing the app's current URL, with copy-to-clipboard and open-in-new-tab actions and a warning when running in an embedded preview.",
  "frontend/src/features/publishShare/useIsEmbeddedPreview.ts": "Hook that detects whether the app is running inside an iframe by comparing window.self to window.top.",
  "frontend/src/features/reminders/RemindersDueNotifier.tsx": "Background component that polls reminders every 10 seconds and triggers a notification via TimerAlertsProvider when a reminder becomes due.",
  "frontend/src/features/reminders/RemindersView.tsx": "React component that renders a reminders card with add/edit/delete dialogs, displaying reminders sorted by due date with title and formatted datetime.",
  "frontend/src/features/reminders/useReminders.ts": "Custom hook managing CRUD operations for reminders, persisting state to localStorage via safeStorage utilities.",
  "frontend/src/features/sounds/CustomSoundsProvider.tsx": "React context provider that manages custom sounds state, supporting add/update/remove/reorder operations for both URL and file-based sounds, with volume persistence and YouTube playback support.",
  "frontend/src/features/sounds/customSoundsStorage.ts": "Utility module for loading, saving, and validating custom sounds in localStorage, enforcing a 10-sound limit and 4MB storage cap, with helpers for file-to-data-URL conversion and audio file validation.",
  "frontend/src/features/sounds/SoundCustomizationPanel.tsx": "UI panel component for managing custom sounds, offering drag-and-drop reordering, add/edit/delete dialogs with URL or file upload tabs, and a volume slider.",
  "frontend/src/features/sounds/useSoundPanelVisibility.ts": "Custom hook that persists and toggles the visibility state of the sound customization panel using localStorage.",
  "frontend/src/features/sounds/youtubeSoundPlayer.ts": "Module that plays audio from YouTube URLs using the IFrame API in a hidden player, with auto-stop after a configurable duration and full cleanup on stop.",
  "frontend/src/features/tasks/TasksPanel.tsx": "A floating panel UI component for managing a task list, supporting bulleted, numbered, and to-do list modes with add, toggle, delete, and clear-all functionality styled in a pink/crimson theme.",
  "frontend/src/features/tasks/useTasks.ts": "Custom React hook that manages task list state (items and list mode) with localStorage persistence via safeStorage, exposing add, toggle, delete, setMode, and clearAll operations.",
  "frontend/src/features/tasks/useTasksPanelVisibility.ts": "Custom React hook that tracks and persists the visibility state of the TasksPanel to localStorage, exposing a toggle function.",
  "frontend/src/features/timers/countdown/CountdownTimer.tsx": "A countdown timer card component with play/pause/reset controls and editable hours, minutes, and seconds duration inputs, triggering an alert notification on completion.",
  "frontend/src/features/timers/countdown/useCountdown.ts": "Custom React hook implementing countdown timer logic with accurate interval tracking, localStorage persistence for duration, and an onComplete callback when the timer reaches zero.",
  "frontend/src/features/timers/interval/IntervalTimer.tsx": "An interval timer card component displaying alternating work/rest intervals across configurable rounds, with play/pause/reset/skip controls and editable interval and round settings.",
  "frontend/src/features/timers/interval/useIntervalTimer.ts": "Custom React hook managing interval timer state with alternating A/B intervals across multiple rounds, accurate tick-based countdown, localStorage persistence for settings, and callbacks for interval and cycle completion.",
  "frontend/src/features/timers/navigation/ReorderableTimerTabs.tsx": "Renders draggable timer mode tabs with pointer-event-based drag-and-drop reordering, animating sibling tabs to shift as the dragged tab moves.",
  "frontend/src/features/timers/navigation/timerModes.ts": "Defines the list of timer modes with their labels, the default tab order, and a helper to look up a mode's display label.",
  "frontend/src/features/timers/navigation/TimerTabOrderSettings.tsx": "Settings UI component that displays instructions for reordering timer tabs and provides a button to reset the tab order to default.",
  "frontend/src/features/timers/navigation/useTimerTabOrder.ts": "Custom hook that persists and restores the timer tab order in localStorage, normalizing stored values against the default order.",
  "frontend/src/features/timers/pomodoro/PomodoroTimer.tsx": "Pomodoro timer UI card displaying the current segment, countdown, completed pomodoro count, playback controls, and editable duration settings.",
  "frontend/src/features/timers/pomodoro/usePomodoro.ts": "Custom hook managing Pomodoro timer state including work/break segments, accurate interval ticking, settings persistence in localStorage, and segment-complete callbacks.",
  "frontend/src/features/timers/repeating/RepeatingTimer.tsx": "Repeating timer UI card showing countdown, completed cycle count, playback controls, and settings for duration, repeat count, and infinite mode toggle.",
  "frontend/src/features/timers/repeating/useRepeatingTimer.ts": "Custom hook managing repeating timer state with accurate interval ticking, cycle counting, infinite mode support, settings persistence, and a completion callback.",
  "frontend/src/features/timers/shared/AnimatedDialRing.tsx": "SVG component rendering a dual-ring animated dial where the outer ring tracks seconds (0–59) and the inner ring tracks minutes (0–59), with tick marks and smooth CSS transitions.",
  "frontend/src/features/timers/shared/EditableNumberInput.tsx": "Controlled numeric text input that syncs with an external value when unfocused, clamps input to min/max on blur, and supports Enter/Escape key handling.",
  "frontend/src/features/timers/shared/MinutesSecondsInput.tsx": "Composite input component for entering a duration as separate minutes and seconds fields, converting to/from a total-seconds value with clamping.",
  "frontend/src/features/timers/shared/RotaryDial.tsx": "Draggable rotary dial component that maps pointer/touch rotation to a numeric value within a min/max range, displaying the current value with a counter-rotated label.",
  "frontend/src/features/timers/shared/timeFormat.ts": "Utility functions to format a total-seconds value as HH:MM:SS or MM:SS, and a milliseconds value as a similar string with centiseconds appended.",
  "frontend/src/features/timers/shared/useAccurateInterval.ts": "Custom React hook that runs a callback on a setInterval when the `running` flag is true, keeping the callback ref up to date without restarting the interval.",
  "frontend/src/features/timers/stopwatch/StopwatchTimer.tsx": "Stopwatch UI card with start/pause/reset controls, a millisecond-precision time display, and a scrollable lap list.",
  "frontend/src/features/timers/stopwatch/useStopwatch.ts": "Custom hook managing stopwatch state (elapsed time, running status, laps) using a 10ms accurate interval and Date.now()-based elapsed calculation.",
  "frontend/src/features/timers/visibility/TimerVisibilityBar.tsx": "Fixed bottom toolbar displaying a live wall-clock, toggle buttons for timer/task panel visibility, fullscreen control, and settings/music/alert dialogs.",
  "frontend/src/features/timers/visibility/TopLeftClock.tsx": "Fixed top-left clock overlay that shows the current time in 12-hour format and hides itself when an active background (image, video, or YouTube) is set.",
  "frontend/src/features/timers/visibility/useTimerVisibility.ts": "React hook managing timer visibility state with localStorage/sessionStorage persistence, auto-hiding when a background is active, and two additional independent boolean toggles (A and B).",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/index.css": "Global CSS file defining Tailwind directives, light/dark mode CSS custom properties (OKLCH color tokens), fullscreen layout fixes, and a subtle pulse keyframe animation.",
  "frontend/src/lib/safeStorage.ts": "Utility wrapping localStorage/sessionStorage with error handling and an in-memory Map fallback for restricted environments like iframes, exposing safeGetItem, safeSetItem, and safeRemoveItem.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH-based color tokens, Quicksand font, custom border radii, a glow box shadow, accordion animations, and the animate/typography plugins.",
  "project_state.json": "Project state metadata describing TickTockTask's existing features and pending action requests, specifically applying a pink/crimson Settings theme to all toggles and adding Spotify link support to the music feature."
}