{
  "backend/main.mo": "Motoko actor implementing a tic-tac-toe game backend with win/tie detection, score counting, and a `updateGameState` function that returns game features including points and game field state.",
  "feature_evidence.json": "Feature evidence report confirming that the APP_NAME constant in `frontend/src/branding.ts` has been updated to 'TickTockTask', with high confidence and test ID REQ-1.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing their purpose, key APIs used, and notable implementation details for build planning.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for light and dark themes, including background, foreground, card, sidebar, chart, and destructive color variables.",
  "frontend/index.html": "HTML entry point for the React app, loading the Quicksand font from Google Fonts and setting the page title to 'TickTockTask - Multi-timer with customizable backgrounds'.",
  "frontend/src/App.tsx": "Root React component that composes all providers (query, router, background, music, alerts, sounds), renders a stable media layer, timer overlay for fullscreen, and a tab-based multi-timer UI with error boundary.",
  "frontend/src/branding.ts": "Single-export module defining the APP_NAME constant as 'TickTockTask', serving as the single source of truth for app branding.",
  "frontend/src/features/alerts/alertSounds.ts": "Defines available alert sound options and provides a `playAlertSound` utility that plays built-in tones (beep, chime, bell, ping) via the Web Audio API or custom/YouTube sounds via URL.",
  "frontend/src/features/alerts/TimerAlertSettings.tsx": "Settings UI card for timer alerts, allowing users to enable/disable alerts, select a completion sound (including custom sounds), and preview the selected sound.",
  "frontend/src/features/alerts/TimerAlertsProvider.tsx": "React context provider managing timer alert state (enabled toggle, selected sound) with localStorage persistence, and exposing `notifyCompletion` and `previewSound` functions that play audio and show toast notifications.",
  "frontend/src/features/backgrounds/BackgroundCustomizer.tsx": "React component that renders a UI for setting the app background via file upload, direct URL, or YouTube URL, with controls for brightness, volume, and timer overlay toggle.",
  "frontend/src/features/backgrounds/BackgroundFullscreenButton.tsx": "Floating button component that toggles browser fullscreen mode on the background stage element, only rendered when an active background exists.",
  "frontend/src/features/backgrounds/BackgroundPlayButton.tsx": "Floating play/pause button rendered only when a video or YouTube background is active and not in fullscreen, delegating playback toggling to the background context.",
  "frontend/src/features/backgrounds/BackgroundProvider.tsx": "React context provider that wraps the `useBackground` hook and exposes background state and actions to child components, while also managing blob URL cleanup.",
  "frontend/src/features/backgrounds/BackgroundStage.tsx": "Renders the active background (image, video, or YouTube player) fullscreen behind the app, handling play/pause control, error states, and spacebar keyboard shortcut.",
  "frontend/src/features/backgrounds/loadYouTubeIFrameApi.ts": "Loads the YouTube IFrame Player API script once and returns a shared promise that resolves when the API is ready. Also declares global TypeScript types for the YT player interface.",
  "frontend/src/features/backgrounds/mediaSupport.ts": "Provides utility functions for inferring media type from MIME types or URLs, validating URLs, generating error messages, and probing whether a URL loads as an image or video.",
  "frontend/src/features/backgrounds/useBackground.ts": "Custom React hook that manages background state (image, video, or YouTube) with localStorage persistence, boot-time validation of persisted backgrounds, and controls for brightness, volume, and playback.",
  "frontend/src/features/backgrounds/YouTubeBackgroundPlayer.tsx": "Memoized component that initializes and manages a YouTube IFrame player sized to cover the viewport, supporting play/pause, volume control, looping, and error reporting.",
  "frontend/src/features/backgrounds/youtubeUrl.ts": "Parses various YouTube URL formats to extract video IDs and builds optimized YouTube embed URLs with autoplay, loop, and IFrame API parameters.",
  "frontend/src/features/music/MusicProvider.tsx": "React context provider that exposes music state and controls from the useMusic hook to child components via a MusicContext.",
  "frontend/src/features/music/MusicSettings.tsx": "UI component for configuring music playback, allowing users to input a Spotify, Apple Music, or direct audio URL and adjust volume via a slider.",
  "frontend/src/features/music/MusicStage.tsx": "Renders the appropriate audio playback element—a hidden audio tag for direct audio, or off-screen iframes for Spotify and Apple Music embeds—based on the active music source type.",
  "frontend/src/features/music/musicSupport.ts": "Parses music URLs to classify them as Spotify, Apple Music, direct audio, or unknown, and converts share links into embeddable URLs.",
  "frontend/src/features/music/useMusic.ts": "Custom React hook that manages music playback state (source URL, type, embed URL, volume) with localStorage persistence and an audio element ref for direct audio control.",
  "frontend/src/features/navigation/NavigationTabOrderSettings.tsx": "Settings UI component that displays instructions for drag-reordering navigation tabs and provides a button to reset the tab order to its default.",
  "frontend/src/features/navigation/navigationTabs.ts": "Defines the NavigationTabId type, tab definitions, default order array, and a helper to look up a tab's label by ID.",
  "frontend/src/features/navigation/ReorderableNavigationTabs.tsx": "Navigation tab bar component that supports pointer-based drag-and-drop reordering via a grip handle, updating the tab order on drop.",
  "frontend/src/features/navigation/useNavigationTabOrder.ts": "Custom hook that loads, persists, and normalizes the navigation tab order from localStorage, with a reset function to restore the default order.",
  "frontend/src/features/publishShare/PublishShareSheet.tsx": "Sheet component that displays the current URL for sharing, with copy-to-clipboard and open-in-new-tab actions, and a warning when running inside an embedded preview iframe.",
  "frontend/src/features/publishShare/useIsEmbeddedPreview.ts": "Hook that detects whether the app is running inside an iframe by comparing window.self to window.top, returning true if embedded.",
  "frontend/src/features/reminders/RemindersDueNotifier.tsx": "Background component that polls reminders every 10 seconds and triggers a notification via the alerts system when a reminder's due date has passed.",
  "frontend/src/features/reminders/RemindersView.tsx": "UI component for managing reminders, providing dialogs to add and edit reminders with a title and datetime, and displaying them sorted by due date with delete and edit actions.",
  "frontend/src/features/reminders/useReminders.ts": "Custom hook that manages a list of reminders in localStorage, exposing add, update, and delete operations with stable callbacks.",
  "frontend/src/features/sounds/CustomSoundsProvider.tsx": "React context provider that manages custom sounds state, including adding/removing/reordering sounds via URL or file upload, volume control, and preview playback with localStorage persistence.",
  "frontend/src/features/sounds/customSoundsStorage.ts": "Utility module for persisting custom sounds to localStorage, including load/save with size validation, sound ID generation, file-to-data-URL conversion, and audio file type validation.",
  "frontend/src/features/sounds/SoundCustomizationPanel.tsx": "UI panel component for managing custom sounds, offering add/edit/delete/reorder (drag-and-drop and buttons) functionality with dialogs for URL or file upload input and a volume slider.",
  "frontend/src/features/sounds/useSoundPanelVisibility.ts": "Custom hook that tracks and persists the sound panel's visible/hidden state to localStorage.",
  "frontend/src/features/sounds/youtubeSoundPlayer.ts": "Module that plays audio from YouTube URLs using the IFrame API via a hidden player, with auto-stop after a configurable duration and cleanup utilities.",
  "frontend/src/features/timers/countdown/CountdownTimer.tsx": "Countdown timer UI card component with editable hours/minutes/seconds inputs, play/pause/reset controls, and completion alert notification.",
  "frontend/src/features/timers/countdown/useCountdown.ts": "Custom hook implementing countdown timer logic with accurate interval tracking, pause/resume support, completion callback, and duration persistence in localStorage.",
  "frontend/src/features/timers/interval/IntervalTimer.tsx": "React component rendering an interval timer card with work/rest display, play/pause/reset/skip controls, and configurable settings for interval durations and rounds.",
  "frontend/src/features/timers/interval/useIntervalTimer.ts": "Custom hook managing interval timer state (work/rest intervals, rounds, countdown) with localStorage persistence, accurate tick logic, and start/pause/reset/skip controls.",
  "frontend/src/features/timers/navigation/ReorderableTimerTabs.tsx": "React component providing drag-and-drop reorderable timer navigation tabs using pointer events, with visual offset animations during dragging.",
  "frontend/src/features/timers/navigation/timerModes.ts": "Defines the list of available timer modes with their labels, the default tab order, and a helper function to look up a mode's display label.",
  "frontend/src/features/timers/navigation/TimerTabOrderSettings.tsx": "Small settings UI component that displays instructions for reordering timer tabs and provides a button to reset the tab order to default.",
  "frontend/src/features/timers/navigation/useTimerTabOrder.ts": "Custom hook that loads, persists, and normalizes the timer tab order from localStorage, with deduplication and missing-mode recovery.",
  "frontend/src/features/timers/pomodoro/PomodoroTimer.tsx": "React component rendering a Pomodoro timer card with segment display, play/pause/reset/skip controls, and configurable work/break durations and long-break interval.",
  "frontend/src/features/timers/pomodoro/usePomodoro.ts": "Custom hook managing Pomodoro timer state including work/short-break/long-break segments, completed pomodoro count, localStorage persistence, and accurate countdown logic.",
  "frontend/src/features/timers/repeating/RepeatingTimer.tsx": "React component rendering a repeating timer card with play/pause/reset controls, a time display, completed repeat count, and settings for duration and repeat count (including infinite mode).",
  "frontend/src/features/timers/repeating/useRepeatingTimer.ts": "Custom hook managing repeating timer state (countdown, repeat cycling, pause/resume) with localStorage persistence and an optional onComplete callback.",
  "frontend/src/features/timers/shared/AnimatedDialRing.tsx": "SVG component that renders two animated concentric arc rings representing seconds (outer) and minutes (inner) progress, with tick marks and a moving dot indicator.",
  "frontend/src/features/timers/shared/EditableNumberInput.tsx": "Controlled numeric text input component that allows inline editing with clamping to min/max on blur and supports keyboard confirmation/cancellation.",
  "frontend/src/features/timers/shared/MinutesSecondsInput.tsx": "Composite input component that splits a total-seconds value into separate minutes and seconds EditableNumberInput fields and recombines them on change.",
  "frontend/src/features/timers/shared/RotaryDial.tsx": "Draggable rotary dial component that maps pointer/touch drag angle to a numeric value within a min/max range, displaying the current value with a rotating indicator dot.",
  "frontend/src/features/timers/shared/timeFormat.ts": "Utility functions for formatting a total-seconds value into HH:MM:SS or MM:SS strings, and milliseconds into a similar format with centisecond precision.",
  "frontend/src/features/timers/shared/useAccurateInterval.ts": "Custom hook that sets up a setInterval with a stable callback ref, only running when the `running` flag is true and cleaning up on stop or unmount.",
  "frontend/src/features/timers/stopwatch/StopwatchTimer.tsx": "React component rendering a stopwatch UI card with start/pause, reset, and lap recording controls, displaying elapsed time and a scrollable lap history.",
  "frontend/src/features/timers/stopwatch/useStopwatch.ts": "Custom hook managing stopwatch state (elapsed time, running status, laps) with start, pause, reset, and lap recording actions using an accurate interval.",
  "frontend/src/features/timers/visibility/TimerVisibilityBar.tsx": "Fixed bottom toolbar component showing a wall clock and toggle controls for timer visibility, music, alerts, settings, and sharing.",
  "frontend/src/features/timers/visibility/TopLeftClock.tsx": "Fixed top-left clock display that shows the current time and hides itself when an active background (image, video, or YouTube) is set.",
  "frontend/src/features/timers/visibility/useTimerVisibility.ts": "Custom hook managing timer and toggle visibility state with localStorage/sessionStorage persistence, and auto-hiding the timer when a background becomes active.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining light/dark OKLCH CSS custom properties for the design system and utility classes for drag animations and drop targets.",
  "frontend/src/lib/safeStorage.ts": "Utility wrapping localStorage and sessionStorage with error handling and an in-memory fallback for restricted environments like iframes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining dark mode, custom color tokens using oklch CSS variables, typography, border radius, box shadow, and accordion animations.",
  "project_state.json": "Tracks project state at version 3, recording one existing feature that updates the APP_NAME constant in branding.ts to 'TickTockTask' with no new feature requests or known issues."
}