{
  "kind": "build_request",
  "title": "Add fullscreen button to fill screen with user-chosen background",
  "projectName": "TickTaskTime",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a fullscreen button (fixed or floating in the UI) that, when clicked, triggers the browser's Fullscreen API on the background stage element so the entire screen is filled with the user's currently active background (image, video, or YouTube). The button should also serve as an exit-fullscreen toggle when already in fullscreen mode, updating its icon/label accordingly. The button should only be visible when a background is active.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "let there be a fullscreen button, and when you click it, the whole screen should be filled with the background the user chose."
        ]
      },
      "acceptanceCriteria": [
        "A fullscreen button is visible in the UI when a background (image, video, or YouTube) is active.",
        "Clicking the fullscreen button causes the browser to enter fullscreen mode, displaying only the user's chosen background filling the entire screen.",
        "While in fullscreen mode, the button changes to indicate 'exit fullscreen' functionality.",
        "Clicking the button again (or pressing Escape) exits fullscreen and returns to the normal app layout.",
        "The button is not shown when no background is active.",
        "Works correctly for all background types: image, video, and YouTube embed."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/ (useInternetIdentity.ts, useActor.ts) or frontend/src/main.tsx.",
    "Do not modify files under frontend/src/components/ui.",
    "Use the browser's native Fullscreen API (requestFullscreen / exitFullscreen) rather than CSS-only tricks."
  ],
  "nonGoals": [
    "Changing the background selection or customization UI.",
    "Adding fullscreen support for the timer overlay or any non-background UI elements.",
    "Persisting fullscreen state across page reloads."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}