{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Play button with fullscreen video and optional timer overlay",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add play/pause button with spacebar toggle for video playback",
      "acceptanceCriteria": [
        "A play/pause button is visible in the UI.",
        "Clicking the button toggles the video between playing and paused.",
        "Pressing the spacebar toggles the video between playing and paused.",
        "The button icon reflects the current state (play icon when paused, pause icon when playing)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/backgrounds/useBackground.ts",
          "operation": "modify",
          "description": "Add playback state management (isPlaying boolean) to the background hook state, with play/pause/toggle methods and localStorage persistence for the playback state."
        },
        {
          "path": "frontend/src/features/backgrounds/BackgroundStage.tsx",
          "operation": "modify",
          "description": "Wire the playback state from useBackground to control video/YouTube player play/pause, and add a global spacebar keydown listener that calls the toggle method when the background is video or YouTube."
        },
        {
          "path": "frontend/src/features/backgrounds/BackgroundPlayButton.tsx",
          "operation": "create",
          "description": "Create a floating play/pause button component positioned over the background that reads playback state from BackgroundProvider and calls the toggle method on click, displaying a play icon when paused and pause icon when playing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Render the BackgroundPlayButton component in the stable media layer section, positioned to float above the BackgroundStage."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Enter fullscreen mode showing only video when playback starts",
      "acceptanceCriteria": [
        "Triggering play causes the video to expand to fullscreen.",
        "All UI elements (navigation, bottom bar, panels, play button) are hidden during fullscreen playback.",
        "Pausing the video (via spacebar) exits fullscreen and restores the normal UI.",
        "The video fills the entire viewport with no visible chrome."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/backgrounds/useBackground.ts",
          "operation": "modify",
          "description": "Add isFullscreen boolean state that automatically becomes true when playback starts and false when playback pauses, providing a computed value exposed by the hook."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Read isFullscreen from BackgroundProvider and conditionally hide the entire layout (ReorderableTimerTabs, Outlet, TimerVisibilityBar) when isFullscreen is true, showing only the BackgroundStage."
        },
        {
          "path": "frontend/src/features/backgrounds/BackgroundPlayButton.tsx",
          "operation": "modify",
          "description": "Hide the play button component when isFullscreen is true so it does not appear during fullscreen playback."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Provide toggle between plain video and video with timer overlay during fullscreen",
      "acceptanceCriteria": [
        "A toggle or setting is available that switches between 'plain video' and 'video with timer overlay' modes.",
        "In 'plain video' mode, fullscreen playback shows only the video with no overlays.",
        "In 'video with timer overlay' mode, the user's chosen timer (e.g., countdown, pomodoro, stopwatch) is rendered on top of the fullscreen video.",
        "The timer overlay is readable and does not obscure the entire video.",
        "The selected mode is persisted to localStorage and restored on reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/backgrounds/useBackground.ts",
          "operation": "modify",
          "description": "Add showTimerOverlay boolean state with localStorage persistence and a toggle method, exposing both the value and toggle function from the hook."
        },
        {
          "path": "frontend/src/features/backgrounds/BackgroundCustomizer.tsx",
          "operation": "modify",
          "description": "Add a labeled checkbox or switch control in the UI that reads showTimerOverlay from BackgroundProvider and calls the toggle method on change, labeled as 'Show timer overlay in fullscreen'."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "When isFullscreen is true and showTimerOverlay is true, render the active timer component (from the current route outlet) as an overlay positioned above the BackgroundStage with appropriate styling for visibility against video."
        }
      ]
    }
  ]
}