{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix timer restart on hide timer toggle",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the 'hide timer' toggle so that toggling timer visibility does not reset or restart any running timer, only affecting the visual display while leaving all timer state unchanged",
      "acceptanceCriteria": [
        "Starting a countdown timer and then toggling 'hide timer' does not reset the countdown or pause it unexpectedly.",
        "Re-showing the timer panel after hiding displays the correct current time (as if it had been running in the background).",
        "The same behavior holds for stopwatch, pomodoro, interval, and repeating timers.",
        "The 'hide timer' toggle exclusively controls panel visibility and has no side effect on any timer state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/timers/visibility/useTimerVisibility.ts",
          "operation": "modify",
          "description": "Review and fix the useTimerVisibility hook to ensure toggling visibility does not trigger any timer state changes or re-renders that would reset timers. Remove or fix any side effects in the visibility toggle that might cause dependent timer components to remount or reinitialize their state."
        },
        {
          "path": "frontend/src/features/timers/visibility/TimerVisibilityBar.tsx",
          "operation": "modify",
          "description": "Review the TimerVisibilityBar component to ensure the visibility toggle button only updates the visibility state without triggering any unintended side effects. Verify that the toggle action does not cause parent component re-renders that would unmount/remount timer components."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Review how timer visibility state is consumed in the root App component. Ensure that conditional rendering based on timer visibility does not unmount timer components (which would reset their state), but instead only hides them via CSS (display:none or visibility:hidden) so timers continue running in the background."
        },
        {
          "path": "frontend/src/features/timers/countdown/useCountdown.ts",
          "operation": "modify",
          "description": "Review the useCountdown hook to ensure it does not have any dependencies on visibility state that would cause it to reinitialize when visibility toggles. Verify that localStorage persistence logic does not interfere with running timers during visibility changes."
        },
        {
          "path": "frontend/src/features/timers/stopwatch/useStopwatch.ts",
          "operation": "modify",
          "description": "Review the useStopwatch hook to ensure it does not have any dependencies on visibility state that would cause it to reinitialize when visibility toggles. Verify that state persistence does not interfere with running timers during visibility changes."
        },
        {
          "path": "frontend/src/features/timers/pomodoro/usePomodoro.ts",
          "operation": "modify",
          "description": "Review the usePomodoro hook to ensure it does not have any dependencies on visibility state that would cause it to reinitialize when visibility toggles. Verify that state persistence does not interfere with running timers during visibility changes."
        },
        {
          "path": "frontend/src/features/timers/interval/useIntervalTimer.ts",
          "operation": "modify",
          "description": "Review the useIntervalTimer hook to ensure it does not have any dependencies on visibility state that would cause it to reinitialize when visibility toggles. Verify that state persistence does not interfere with running timers during visibility changes."
        },
        {
          "path": "frontend/src/features/timers/repeating/useRepeatingTimer.ts",
          "operation": "modify",
          "description": "Review the useRepeatingTimer hook to ensure it does not have any dependencies on visibility state that would cause it to reinitialize when visibility toggles. Verify that state persistence does not interfere with running timers during visibility changes."
        }
      ]
    }
  ]
}