{
  "backend/main.mo": "Empty Motoko actor with no state or backend logic.",
  "feature_evidence.json": "Feature evidence report listing background-clarity-related features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files including timers, backgrounds, media utilities, and UI components.",
  "frontend/index.css": "Tailwind base styles defining OKLCH theme tokens for light/dark modes and global background/foreground variables.",
  "frontend/index.html": "HTML entry file loading Quicksand font and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main React app component wiring background, music, and timer modes with settings and share sheet UI.",
  "frontend/src/features/backgrounds/BackgroundCustomizer.tsx": "UI for selecting image, video, URL, or YouTube backgrounds with validation, error handling, and clear actions.",
  "frontend/src/features/backgrounds/BackgroundProvider.tsx": "Context provider wrapping useBackground and revoking old blob URLs to manage background state and cleanup.",
  "frontend/src/features/backgrounds/BackgroundStage.tsx": "Renders full-screen image, video, or YouTube backgrounds with error handling and no dimming overlay.",
  "frontend/src/features/backgrounds/mediaSupport.ts": "Utilities for inferring media types, validating URLs, extracting extensions, probing image/video loadability, and generating error messages.",
  "frontend/src/features/backgrounds/useBackground.ts": "React hook managing background media state, loading from files or URLs, probing media, handling YouTube, and persisting settings.",
  "frontend/src/features/backgrounds/youtubeUrl.ts": "Parses YouTube URLs to extract video IDs and builds optimized YouTube embed URLs.",
  "frontend/src/features/music/MusicProvider.tsx": "Context provider exposing music playback state and controls via useMusic.",
  "frontend/src/features/music/MusicSettings.tsx": "UI component for configuring music source URLs, volume, and clearing playback with validation and error display.",
  "frontend/src/features/music/MusicStage.tsx": "Handles playback of direct audio or embedded Spotify/Apple Music using hidden elements and error handling.",
  "frontend/src/features/music/musicSupport.ts": "Parses music URLs to classify them as Spotify, Apple Music, or direct audio and constructs embed URLs with error helpers.",
  "frontend/src/features/music/useMusic.ts": "React hook managing music source parsing, audio element volume, error handling, and persistence in localStorage.",
  "frontend/src/features/publishShare/PublishShareSheet.tsx": "UI sheet that displays the current URL, allows copying or opening it, and shows publishing instructions with embedded-preview awareness.",
  "frontend/src/features/publishShare/useIsEmbeddedPreview.ts": "Hook that detects whether the app is running inside an iframe using a safety-checked window comparison.",
  "frontend/src/features/timers/countdown/CountdownTimer.tsx": "Countdown timer UI letting users set hours/minutes/seconds and control start, pause, and reset.",
  "frontend/src/features/timers/countdown/useCountdown.ts": "Hook implementing countdown logic with pause/resume, localStorage persistence, and accurate interval timing.",
  "frontend/src/features/timers/interval/IntervalTimer.tsx": "Interval timer UI showing current interval, rounds, progress, and controls plus editable work/rest durations.",
  "frontend/src/features/timers/interval/useIntervalTimer.ts": "Hook managing alternating interval timing, rounds, persistence, and skip/reset logic using accurate intervals.",
  "frontend/src/features/timers/pomodoro/PomodoroTimer.tsx": "UI component for the Pomodoro timer, displaying time, controls, segment status, and editable settings.",
  "frontend/src/features/timers/pomodoro/usePomodoro.ts": "Hook managing Pomodoro state, timing, segment transitions, persistence, and settings updates.",
  "frontend/src/features/timers/repeating/RepeatingTimer.tsx": "UI component for a repeating countdown timer with controls, duration inputs, repeat settings, and infinite mode display.",
  "frontend/src/features/timers/repeating/useRepeatingTimer.ts": "Hook implementing repeating countdown logic with persistence, auto-restart, repeat counting, and infinite mode.",
  "frontend/src/features/timers/shared/timeFormat.ts": "Utility functions to format seconds or milliseconds into human-readable time strings.",
  "frontend/src/features/timers/shared/useAccurateInterval.ts": "React hook for stable interval execution that stays accurate across renders.",
  "frontend/src/features/timers/stopwatch/StopwatchTimer.tsx": "UI component for a stopwatch with time display, start/pause/reset actions, and lap recording list.",
  "frontend/src/features/timers/stopwatch/useStopwatch.ts": "Hook managing stopwatch timing, lap recording, and interval-based elapsed time updates.",
  "frontend/src/features/timers/visibility/TimerVisibilityBar.tsx": "UI bar allowing the user to toggle overall timer visibility.",
  "frontend/src/features/timers/visibility/useTimerVisibility.ts": "Hook managing timer visibility state with persistence and auto-hide behavior based on background activity.",
  "frontend/src/hooks/useActor.ts": "Creates a React Query-managed backend actor based on the current Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity auth state, loading stored identities, and handling login/logout via AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color variables, themes, and utility classes for typography and timer display.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata including features, issues, design notes, and summary of the timer app’s current state."
}