{
  "backend/main.mo": "Minimal actor with no state or backend logic.",
  "feature_evidence.json": "Feature evidence report mapping features to implementation files and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files for quick reference.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH-based theme tokens for light and dark modes.",
  "frontend/index.html": "Base HTML template loading Quicksand font and mounting the React app.",
  "frontend/src/App.tsx": "Main app component providing timer modes, settings sheets, background and music integration.",
  "frontend/src/features/backgrounds/BackgroundCustomizer.tsx": "UI for setting backgrounds via upload, URL, or YouTube with brightness and volume controls.",
  "frontend/src/features/backgrounds/BackgroundProvider.tsx": "Context provider wrapping useBackground and handling blob URL lifecycle cleanup.",
  "frontend/src/features/backgrounds/BackgroundStage.tsx": "Renders image, video, or YouTube backgrounds with brightness control and error handling. Manages playback issues and clears invalid backgrounds.",
  "frontend/src/features/backgrounds/loadYouTubeIFrameApi.ts": "Loads the YouTube IFrame API once and exposes a promise that resolves when ready. Defines basic TypeScript types for the YouTube player.",
  "frontend/src/features/backgrounds/mediaSupport.ts": "Provides helpers to infer media types, validate URLs, probe image/video loadability, and create user‑friendly media error messages. Also extracts file extensions from URLs.",
  "frontend/src/features/backgrounds/useBackground.ts": "Manages background state with persistence, URL validation, media probing, and YouTube handling. Restores stored backgrounds after validating they still load.",
  "frontend/src/features/backgrounds/YouTubeBackgroundPlayer.tsx": "Creates and sizes a YouTube iframe player for background playback with autoplay, volume control, and error reporting. Handles player initialization and viewport resizing.",
  "frontend/src/features/backgrounds/youtubeUrl.ts": "Parses YouTube URLs to extract video IDs and builds embed URLs with autoplay and loop settings. Supports multiple YouTube URL formats with error reporting.",
  "frontend/src/features/music/MusicProvider.tsx": "Provides a context for music playback state and actions including source, volume, errors, and audio ref. Wraps children with the music context from useMusic.",
  "frontend/src/features/music/MusicSettings.tsx": "UI for setting music URL, clearing playback, and adjusting volume using context state.",
  "frontend/src/features/music/MusicStage.tsx": "Handles actual playback via hidden audio or Spotify/Apple embeds and reports load errors.",
  "frontend/src/features/music/musicSupport.ts": "Parses URLs to classify music sources and generate embed URLs or direct audio links.",
  "frontend/src/features/music/useMusic.ts": "Manages music state, persistence, parsing, playback settings, and audio ref handling.",
  "frontend/src/features/publishShare/PublishShareSheet.tsx": "Provides a sheet to copy or open the current URL and shows publishing instructions.",
  "frontend/src/features/publishShare/useIsEmbeddedPreview.ts": "Detects whether the app is running inside an iframe to adjust sharing behavior.",
  "frontend/src/features/timers/countdown/CountdownTimer.tsx": "Countdown timer UI with start, pause, reset, and duration editing controls.",
  "frontend/src/features/timers/countdown/useCountdown.ts": "Implements countdown logic with persistence, pausing, resetting, and precise interval updates.",
  "frontend/src/features/timers/interval/IntervalTimer.tsx": "UI component for an interval timer allowing start, pause, skip, reset, and editing interval and round settings.",
  "frontend/src/features/timers/interval/useIntervalTimer.ts": "Hook managing interval timer logic, state persistence, countdown behavior, and interval/round transitions.",
  "frontend/src/features/timers/pomodoro/PomodoroTimer.tsx": "UI component for a Pomodoro timer with work/break cycles, controls, and editable durations.",
  "frontend/src/features/timers/pomodoro/usePomodoro.ts": "Hook implementing Pomodoro cycle logic, persistence, segment switching, and countdown handling.",
  "frontend/src/features/timers/repeating/RepeatingTimer.tsx": "UI component for a repeating countdown timer with configurable duration, repeats, and infinite mode.",
  "frontend/src/features/timers/repeating/useRepeatingTimer.ts": "Hook containing logic for repeating countdowns, handling repeats, persistence, and timing updates.",
  "frontend/src/features/timers/shared/EditableNumberInput.tsx": "Reusable numeric input allowing free typing with validation and clamping on blur.",
  "frontend/src/features/timers/shared/RotaryDial.tsx": "A draggable rotary dial UI component that converts pointer rotation into a numeric value and updates via onChange.",
  "frontend/src/features/timers/shared/timeFormat.ts": "Provides helper functions to format seconds or milliseconds into human‑readable time strings.",
  "frontend/src/features/timers/shared/useAccurateInterval.ts": "React hook that runs a callback on a precise interval while a running flag is true.",
  "frontend/src/features/timers/stopwatch/StopwatchTimer.tsx": "UI for a stopwatch timer with start, pause, reset, and lap recording, displaying elapsed time and lap list.",
  "frontend/src/features/timers/stopwatch/useStopwatch.ts": "Hook implementing stopwatch logic including timing, laps, and integration with an accurate interval.",
  "frontend/src/features/timers/visibility/TimerVisibilityBar.tsx": "A bottom bar with a button to toggle timer visibility, showing different icons based on state.",
  "frontend/src/features/timers/visibility/useTimerVisibility.ts": "Manages persisted timer visibility state with auto‑hide behavior and toggle handling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, invalidating related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading identities, handling login, logout, and status.",
  "frontend/src/index.css": "Tailwind setup plus custom theme variables and utility classes, including rotary dial and timer styles.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom theme extensions, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing current issues with background loading, existing features for auto-clearing broken backgrounds, and notes for recovery behavior."
}