{
  "backend/main.mo": "Empty Motoko actor with no state or backend logic.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend files across timers, backgrounds, and UI.",
  "frontend/index.css": "Tailwind base layer defining OKLCH theme tokens for light and dark modes and applying global background/foreground styles.",
  "frontend/index.html": "App HTML shell loading Google Fonts and mounting the React application via main.tsx.",
  "frontend/src/App.tsx": "Main app component with tabbed navigation, timer views, background/music layers, settings sheet, reminders, and alert integration.",
  "frontend/src/branding.ts": "Exports the app’s display name constant.",
  "frontend/src/features/alerts/TimerAlertSettings.tsx": "UI card allowing users to toggle timer completion alerts.",
  "frontend/src/features/alerts/TimerAlertsProvider.tsx": "Context provider storing alert settings and triggering toast and beep notifications on timer completion.",
  "frontend/src/features/backgrounds/BackgroundCustomizer.tsx": "Interface for selecting image/video/YouTube backgrounds with brightness and volume controls, validation, and error handling.",
  "frontend/src/features/backgrounds/BackgroundProvider.tsx": "Provides background context using useBackground and manages cleanup of blob URLs.",
  "frontend/src/features/backgrounds/BackgroundStage.tsx": "Renders image, video, or YouTube backgrounds with brightness control and error handling.",
  "frontend/src/features/backgrounds/loadYouTubeIFrameApi.ts": "Loads the YouTube IFrame API once and exposes YTPlayer type definitions.",
  "frontend/src/features/backgrounds/mediaSupport.ts": "Utility functions for detecting media types, validating URLs, probing loadability, and generating error messages.",
  "frontend/src/features/backgrounds/useBackground.ts": "Manages background state, persistence, validation, and helpers for setting image, video, or YouTube backgrounds.",
  "frontend/src/features/backgrounds/YouTubeBackgroundPlayer.tsx": "Creates a YouTube iframe player that auto-sizes to cover the viewport and reports playback errors.",
  "frontend/src/features/backgrounds/youtubeUrl.ts": "Parses YouTube URLs to extract video IDs and builds background-optimized embed URLs.",
  "frontend/src/features/music/MusicProvider.tsx": "Provides music playback context using useMusic for source selection, volume, and error handling.",
  "frontend/src/features/music/MusicSettings.tsx": "UI for setting music URL, clearing playback, and adjusting volume using context state.",
  "frontend/src/features/music/MusicStage.tsx": "Renders hidden audio or embedded Spotify/Apple players and manages direct-audio playback lifecycle.",
  "frontend/src/features/music/musicSupport.ts": "Parses URLs to classify Spotify, Apple Music, or direct-audio sources and provides error messaging.",
  "frontend/src/features/music/useMusic.ts": "Manages music state, persistence, URL parsing, audio ref, playback errors, and volume control.",
  "frontend/src/features/publishShare/PublishShareSheet.tsx": "Share sheet showing the current URL with copy/open actions and publishing instructions.",
  "frontend/src/features/publishShare/useIsEmbeddedPreview.ts": "Hook detecting if the app is running inside an iframe preview.",
  "frontend/src/features/reminders/RemindersView.tsx": "UI to list, add, edit, and delete reminders with dialogs and date formatting.",
  "frontend/src/features/reminders/useReminders.ts": "Stores reminders in localStorage and provides add, update, and delete operations.",
  "frontend/src/features/timers/countdown/CountdownTimer.tsx": "UI component for a countdown timer with start, pause, reset, and duration editing controls using useCountdown.",
  "frontend/src/features/timers/countdown/useCountdown.ts": "Custom hook managing countdown logic, state persistence, and accurate ticking with completion callbacks.",
  "frontend/src/features/timers/interval/IntervalTimer.tsx": "UI component for interval training timer showing rounds, interval progress, and controls, powered by useIntervalTimer.",
  "frontend/src/features/timers/interval/useIntervalTimer.ts": "Custom hook implementing alternating interval timing with persistence, skipping, rounds, and completion handling.",
  "frontend/src/features/timers/pomodoro/PomodoroTimer.tsx": "UI component for Pomodoro workflow with segment display, controls, and adjustable durations using usePomodoro.",
  "frontend/src/features/timers/pomodoro/usePomodoro.ts": "Custom hook managing Pomodoro segments, durations, state persistence, and automatic transitions with callbacks.",
  "frontend/src/features/timers/repeating/RepeatingTimer.tsx": "UI component for a repeating countdown timer with controls, duration inputs, repeat settings, and infinite mode.",
  "frontend/src/features/timers/repeating/useRepeatingTimer.ts": "React hook managing repeating timer logic, persistence, intervals, and completion handling.",
  "frontend/src/features/timers/shared/EditableNumberInput.tsx": "Numeric text input component that validates, clamps, and syncs values on blur.",
  "frontend/src/features/timers/shared/RotaryDial.tsx": "Rotary dial UI control allowing value adjustment via circular dragging with rotation tracking.",
  "frontend/src/features/timers/shared/timeFormat.ts": "Utility functions formatting seconds or milliseconds into readable time strings.",
  "frontend/src/features/timers/shared/useAccurateInterval.ts": "Hook providing an interval that reliably calls a callback while running.",
  "frontend/src/features/timers/stopwatch/StopwatchTimer.tsx": "UI component for a stopwatch with start, pause, reset, and lap recording features.",
  "frontend/src/features/timers/stopwatch/useStopwatch.ts": "React hook implementing stopwatch timing, laps, and interval-driven updates.",
  "frontend/src/features/timers/visibility/TimerVisibilityBar.tsx": "Visibility toggle bar UI for showing or hiding timer components.",
  "frontend/src/features/timers/visibility/useTimerVisibility.ts": "Hook managing persistent timer visibility state with auto-hide behavior.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing backend actors tied to identity changes with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking using AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables, themes, and utility classes including styling for timers, YouTube backgrounds, and a rotary dial UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins, mapping CSS variables to theme values.",
  "project_state.json": "Tracks project state, features, issues, and pending requests for the TickTask app including timers, styling, and reminders."
}