{
  "backend/main.mo": "Minimal Motoko actor with no state or backend logic.",
  "feature_evidence.json": "Feature evidence report mapping features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of each frontend file.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables and dark-mode theming.",
  "frontend/index.html": "HTML entry point rendering the root element and loading the React app.",
  "frontend/src/App.tsx": "Main app shell with header, background settings sheet, and tab-based timer mode switching.",
  "frontend/src/features/backgrounds/BackgroundCustomizer.tsx": "UI for selecting backgrounds via upload, URL, or YouTube, with validation and error handling.",
  "frontend/src/features/backgrounds/BackgroundStage.tsx": "Renders image, video, or YouTube iframe backgrounds with autoplay handling and error display.",
  "frontend/src/features/backgrounds/mediaSupport.ts": "Helpers for inferring media type from MIME and generating fallback media error messages.",
  "frontend/src/features/backgrounds/useBackground.ts": "Manages background media state including file, URL, and YouTube sources with localStorage persistence and error handling.",
  "frontend/src/features/backgrounds/youtubeUrl.ts": "Parses YouTube URLs to extract video IDs and builds autoplaying embed URLs for background playback.",
  "frontend/src/features/timers/countdown/CountdownTimer.tsx": "UI component rendering a countdown timer with controls and manual duration inputs.",
  "frontend/src/features/timers/countdown/useCountdown.ts": "Hook providing countdown logic, persistence, start/pause/reset handling, and accurate interval ticking.",
  "frontend/src/features/timers/interval/IntervalTimer.tsx": "UI for an alternating interval timer showing progress, interval settings, and run controls.",
  "frontend/src/features/timers/interval/useIntervalTimer.ts": "Hook implementing interval A/B timing, round progression, persistence, and skip/start/pause logic.",
  "frontend/src/features/timers/pomodoro/PomodoroTimer.tsx": "UI for a Pomodoro timer with segment display, controls, and configurable durations.",
  "frontend/src/features/timers/pomodoro/usePomodoro.ts": "Custom hook managing Pomodoro state, timing, segment transitions, and persistence in localStorage.",
  "frontend/src/features/timers/repeating/RepeatingTimer.tsx": "UI component for a repeating countdown timer with controls, settings inputs, and display.",
  "frontend/src/features/timers/repeating/useRepeatingTimer.ts": "Hook managing repeating timer logic, repeat counting, auto-restart behavior, and saved settings.",
  "frontend/src/features/timers/shared/timeFormat.ts": "Utility functions for formatting seconds and milliseconds into human‑readable time strings.",
  "frontend/src/features/timers/shared/useAccurateInterval.ts": "Custom interval hook ensuring consistent callback execution while running.",
  "frontend/src/features/timers/stopwatch/StopwatchTimer.tsx": "Stopwatch UI component showing elapsed time, controls, and a scrollable lap list.",
  "frontend/src/features/timers/stopwatch/useStopwatch.ts": "Hook implementing stopwatch functionality with elapsed tracking, laps, and interval updates.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH theme variables for light/dark modes, plus base styles and a numeric timer utility class.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an Internet Identity provider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme extensions, OKLCH color variables, animations, typography, container queries, and animate plugins.",
  "project_state.json": "Describes the project’s current state, features, architecture notes, and version metadata for a multi‑mode timer app with background customization."
}