{
  "backend/main.mo": "Minimal actor with no state or game logic.",
  "feature_evidence.json": "Feature evidence report mapping features to associated frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files and their functionality.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens and core styling.",
  "frontend/index.html": "HTML entry point loading fonts and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main app layout with timer tabs, background/music providers, settings sheet, and publish/share UI.",
  "frontend/src/branding.ts": "Defines the app name constant.",
  "frontend/src/features/alerts/TimerAlertSettings.tsx": "Settings card allowing users to enable or disable timer completion alerts.",
  "frontend/src/features/alerts/TimerAlertsProvider.tsx": "Context provider managing alert settings, persistence, and completion notifications with sound.",
  "frontend/src/features/backgrounds/BackgroundCustomizer.tsx": "UI for selecting and configuring image, video, or YouTube backgrounds with brightness and volume controls.",
  "frontend/src/features/backgrounds/BackgroundProvider.tsx": "Context wrapper for background state with cleanup of blob URLs and access to useBackground logic.",
  "frontend/src/features/backgrounds/BackgroundStage.tsx": "Renders image, video, or YouTube backgrounds with brightness control and error handling, clearing backgrounds on failures. Manages media loading, playback errors, and YouTube-specific issues.",
  "frontend/src/features/backgrounds/loadYouTubeIFrameApi.ts": "Loads the YouTube IFrame API once and exposes a promise that resolves when ready. Defines TypeScript types for the YT player interface.",
  "frontend/src/features/backgrounds/mediaSupport.ts": "Provides media-type inference, URL validation, probing utilities for images and videos, and user-friendly error messages. Includes helpers to extract file extensions and determine supported formats.",
  "frontend/src/features/backgrounds/useBackground.ts": "Manages background state, persistence, and validation for images, videos, and YouTube links. Loads stored configuration, probes media, and exposes background settings and errors.",
  "frontend/src/features/backgrounds/YouTubeBackgroundPlayer.tsx": "Initializes and sizes a YouTube IFrame player for background playback, handling autoplay restrictions and player errors. Rebuilds the player on load and tracks readiness and interaction issues.",
  "frontend/src/features/backgrounds/youtubeUrl.ts": "Extracts YouTube video IDs from multiple URL formats and builds embed URLs with background-friendly parameters. Returns errors for invalid or unsupported YouTube links.",
  "frontend/src/features/music/MusicProvider.tsx": "Provides music playback context using useMusic, exposing source info, volume, errors, and controls. Wraps children in a context provider for global music state.",
  "frontend/src/features/music/MusicSettings.tsx": "UI for setting music source URLs, adjusting volume, and displaying current music state with error handling.",
  "frontend/src/features/music/MusicStage.tsx": "Renders hidden audio or embed players and manages playback, loading, and errors based on music source type.",
  "frontend/src/features/music/musicSupport.ts": "Parses URLs to classify Spotify, Apple Music, or direct-audio links and returns embed URLs or errors.",
  "frontend/src/features/music/useMusic.ts": "Hook managing music state, persistence, parsing, playback errors, and volume with localStorage support.",
  "frontend/src/features/publishShare/PublishShareSheet.tsx": "Bottom sheet UI to copy or open the current URL and show preview warnings with publishing guidance.",
  "frontend/src/features/publishShare/useIsEmbeddedPreview.ts": "Hook detecting whether the app is running inside an iframe for preview mode checks.",
  "frontend/src/features/reminders/RemindersView.tsx": "UI for viewing, adding, editing, and sorting reminders using dialog-based forms.",
  "frontend/src/features/reminders/useReminders.ts": "Hook providing CRUD operations for reminders stored in localStorage.",
  "frontend/src/features/timers/countdown/CountdownTimer.tsx": "UI component for a customizable countdown timer with start, pause, reset, and duration inputs.",
  "frontend/src/features/timers/countdown/useCountdown.ts": "Hook managing countdown logic, persistence, and interval updates with start, pause, and reset.",
  "frontend/src/features/timers/interval/IntervalTimer.tsx": "UI for alternating interval timer rounds with controls, settings inputs, progress display, and cycle alerts.",
  "frontend/src/features/timers/interval/useIntervalTimer.ts": "Hook controlling interval A/B timing cycles, round progression, persistence, and auto-switching behavior.",
  "frontend/src/features/timers/pomodoro/PomodoroTimer.tsx": "UI for Pomodoro timer with work/break segments, controls, segment indicators, and settings editing.",
  "frontend/src/features/timers/pomodoro/usePomodoro.ts": "Hook implementing Pomodoro segment timing, transitions, persistence, and completion tracking.",
  "frontend/src/features/timers/repeating/RepeatingTimer.tsx": "UI component for a repeating countdown timer with controls, settings inputs, and completion notifications.",
  "frontend/src/features/timers/repeating/useRepeatingTimer.ts": "Hook managing repeating timer logic, persistence, interval updates, and completion handling.",
  "frontend/src/features/timers/shared/EditableNumberInput.tsx": "Numeric text input that validates, clamps, and syncs values while supporting focus-based editing.",
  "frontend/src/features/timers/shared/MinutesSecondsInput.tsx": "Composite input splitting total seconds into minutes and seconds with clamping and change propagation.",
  "frontend/src/features/timers/shared/RotaryDial.tsx": "Interactive rotary dial control that converts drag-based rotation into bounded numeric values.",
  "frontend/src/features/timers/shared/timeFormat.ts": "Utility functions for formatting seconds and milliseconds into readable time strings.",
  "frontend/src/features/timers/shared/useAccurateInterval.ts": "Custom interval hook that runs callbacks reliably while reacting to updated dependencies.",
  "frontend/src/features/timers/stopwatch/StopwatchTimer.tsx": "UI for a stopwatch with start, pause, reset, and lap recording plus lap list display.",
  "frontend/src/features/timers/stopwatch/useStopwatch.ts": "Hook implementing stopwatch timing, lap recording, and update intervals.",
  "frontend/src/features/timers/visibility/TimerVisibilityBar.tsx": "Bottom bar UI allowing toggling of timer visibility with show/hide button.",
  "frontend/src/features/timers/visibility/useTimerVisibility.ts": "Hook managing timer visibility state with persistence, auto-hide logic, and user toggling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/index.css": "Tailwind CSS base and custom variables plus utility classes for theming, backgrounds, and custom UI components like a rotary dial.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins using CSS variables for dynamic theming.",
  "project_state.json": "Tracks project metadata, requirements, and feature requests for interval timer and publishing improvements."
}