{
  "backend/main.mo": "Minimal actor with no state or backend logic.",
  "feature_evidence.json": "Feature evidence report mapping two frontend features to their affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base styles and OKLCH theme tokens for light and dark modes.",
  "frontend/index.html": "HTML entry point setting title to TickTaskTime and loading the React app.",
  "frontend/src/App.tsx": "Main app shell with timers, backgrounds, music, settings sheets, and alert providers.",
  "frontend/src/branding.ts": "Exports APP_NAME set to TickTaskTime.",
  "frontend/src/features/alerts/TimerAlertSettings.tsx": "UI card to toggle timer completion alerts.",
  "frontend/src/features/alerts/TimerAlertsProvider.tsx": "Context provider persisting alert settings and showing toast+beep on completion.",
  "frontend/src/features/backgrounds/BackgroundCustomizer.tsx": "UI for choosing image/video/YouTube backgrounds with brightness and volume controls.",
  "frontend/src/features/backgrounds/BackgroundProvider.tsx": "Provides background state and revokes old blob URLs safely.",
  "frontend/src/features/backgrounds/BackgroundStage.tsx": "Renders image, video, or YouTube backgrounds with brightness control and error handling, resetting and clearing state on failures. Manages loading, playback, and displays fallback UI on errors.",
  "frontend/src/features/backgrounds/loadYouTubeIFrameApi.ts": "Loads the YouTube IFrame API once and resolves when ready, exposing TypeScript definitions for the player. Handles script injection failures and global callbacks.",
  "frontend/src/features/backgrounds/mediaSupport.ts": "Provides helpers to infer media types, validate URLs, probe image/video loadability, extract extensions, and generate user-friendly error messages. Supports both MIME and extension-based detection.",
  "frontend/src/features/backgrounds/useBackground.ts": "Manages background state, validating URLs, probing media, loading persisted settings, and supporting image, video, and YouTube backgrounds. Ensures stored configs are sanitized before use.",
  "frontend/src/features/backgrounds/YouTubeBackgroundPlayer.tsx": "Initializes and sizes a YouTube IFrame player for background playback, handling autoplay issues, resize logic, and YouTube error codes. Reports audio and embed errors to the parent.",
  "frontend/src/features/backgrounds/youtubeUrl.ts": "Parses YouTube URLs to extract video IDs across multiple formats and builds embed URLs optimized for background playback. Returns clear error messages for invalid or unsupported URLs.",
  "frontend/src/features/music/MusicProvider.tsx": "Creates a context for managing music playback state, exposing URL, type, volume, and controls backed by useMusic. Ensures components access music state via the provider.",
  "frontend/src/features/music/MusicSettings.tsx": "UI for entering music URLs, controlling volume, and managing active music state with error handling.",
  "frontend/src/features/music/MusicStage.tsx": "Renders hidden audio or embed iframes and manages playback logic for Spotify, Apple Music, or direct audio.",
  "frontend/src/features/music/musicSupport.ts": "Parses music URLs to classify them as Spotify, Apple Music, direct audio, or unknown and generates embed URLs.",
  "frontend/src/features/music/useMusic.ts": "React hook handling music state, persistence, parsing, volume, and playback error management.",
  "frontend/src/features/publishShare/PublishShareSheet.tsx": "Sheet UI for showing the current URL, copying it, opening it, and warning when in embedded preview mode.",
  "frontend/src/features/publishShare/useIsEmbeddedPreview.ts": "Hook detecting whether the app is running inside an iframe to identify preview mode.",
  "frontend/src/features/reminders/RemindersView.tsx": "UI for listing, adding, editing, and deleting reminders with dialogs and sorting by due date.",
  "frontend/src/features/reminders/useReminders.ts": "Hook managing reminders with localStorage persistence and CRUD operations.",
  "frontend/src/features/timers/countdown/CountdownTimer.tsx": "UI component for a configurable countdown timer with start, pause, reset, and time input controls.",
  "frontend/src/features/timers/countdown/useCountdown.ts": "Hook managing countdown logic, persistence, start/pause/reset, and completion callbacks.",
  "frontend/src/features/timers/interval/IntervalTimer.tsx": "UI for an interval timer alternating between A/B intervals with rounds, progress, and controls.",
  "frontend/src/features/timers/interval/useIntervalTimer.ts": "Hook handling interval switching, rounds, timing, persistence, and skip/start/pause/reset logic.",
  "frontend/src/features/timers/pomodoro/PomodoroTimer.tsx": "UI for a Pomodoro timer showing work/break cycles, counts, and adjustable segment settings.",
  "frontend/src/features/timers/pomodoro/usePomodoro.ts": "Hook implementing Pomodoro cycle logic, segment transitions, persistence, and timing controls.",
  "frontend/src/features/timers/repeating/RepeatingTimer.tsx": "UI component for a repeating countdown timer with controls, settings inputs, and completion alerts.",
  "frontend/src/features/timers/repeating/useRepeatingTimer.ts": "Hook managing repeating timer logic, state persistence, countdown, and cycle completion handling.",
  "frontend/src/features/timers/shared/EditableNumberInput.tsx": "Numeric input component allowing controlled editing with clamping, focus handling, and validation.",
  "frontend/src/features/timers/shared/MinutesSecondsInput.tsx": "Component splitting a total seconds value into editable minute and second inputs with clamping.",
  "frontend/src/features/timers/shared/RotaryDial.tsx": "Interactive rotary dial UI for adjusting numeric values via drag or touch rotation.",
  "frontend/src/features/timers/shared/timeFormat.ts": "Utility functions to format seconds or milliseconds into human-readable time strings.",
  "frontend/src/features/timers/shared/useAccurateInterval.ts": "Hook providing an interval tied to React state that maintains callback accuracy during updates.",
  "frontend/src/features/timers/stopwatch/StopwatchTimer.tsx": "UI component for a stopwatch with start, pause, lap recording, and lap list display.",
  "frontend/src/features/timers/stopwatch/useStopwatch.ts": "Hook implementing stopwatch timing, laps, and state updates using an accurate interval.",
  "frontend/src/features/timers/visibility/TimerVisibilityBar.tsx": "Bottom bar UI allowing users to toggle timer visibility.",
  "frontend/src/features/timers/visibility/useTimerVisibility.ts": "Hook managing persisted timer visibility with auto-hide logic and user override tracking.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using React Query, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider that manages authentication state, login, logout, and persisted identities using Dfinity AuthClient.",
  "frontend/src/index.css": "Defines global Tailwind CSS layers, color variables, typography, and utility styles including rotary dial and YouTube background helpers.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider wrappers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins using CSS variables from the theme.",
  "project_state.json": "Stores project metadata, feature definitions, and pending feature requests for the TickTaskTime app."
}