{
  "kind": "build_request",
  "title": "Make background video/image/YouTube rendering максимально clear & bright (match original media)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-29",
      "text": "Remove (or reduce to effectively zero) the global darkening/blur overlay that is rendered on top of active backgrounds in `BackgroundStage` so that video/image/YouTube backgrounds look as close to the original source as possible (clear and bright).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make it as clear as possible. I want it to look like the original video, clear,bright etc"
        ]
      },
      "acceptanceCriteria": [
        "When any background is active (image, video, or YouTube) and no error is displayed, the background is not visibly dimmed or blurred by a global overlay (i.e., it appears essentially as bright/clear as the source).",
        "Timer UI remains readable on top of the background using existing UI surfaces (e.g., cards/header/footer backgrounds) without re-introducing a noticeable full-screen dark overlay.",
        "When a background fails and the error screen is shown, the error screen remains readable and visually distinct from the background."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Ensure the background media elements themselves are not being unintentionally visually degraded (no CSS filters, opacity reductions, or layering artifacts) so that the displayed background matches the original media’s clarity.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make it as clear as possible. I want it to look like the original video, clear,bright etc"
        ]
      },
      "acceptanceCriteria": [
        "For video backgrounds, the `<video>` element renders at full opacity with no dimming filter applied, and fills the viewport (object-cover) without additional softening effects.",
        "For image backgrounds, the rendered background image appears at full opacity with no dimming filter applied, and fills the viewport (cover/center) without additional softening effects.",
        "For YouTube backgrounds, the iframe background appears without additional app-side dimming/blur layers affecting it (beyond what the YouTube player itself may do)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui`.",
    "Keep all changes within the existing React + Tailwind structure; do not add new backend services or external dependencies."
  ],
  "nonGoals": [
    "Do not add new background features (e.g., new background sources, advanced color grading, HDR, or per-background brightness controls) unless required to achieve the requested clarity.",
    "Do not change timer functionality or mode behavior beyond what is necessary to keep the UI readable after making backgrounds clearer.",
    "Do not modify backend code (Motoko) for this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}