{
  "kind": "build_request",
  "title": "Keep timers running across tab switches, update button color, and add Reminders tab",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure each timer (Pomodoro, Stopwatch, Countdown, Interval, Repeating) continues running correctly when the user switches to a different timer tab and then switches back, without pausing, resetting, or losing elapsed/remaining time due to component unmounting/remounting.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make the timers work even if I click on another one, in the tab."
        ]
      },
      "acceptanceCriteria": [
        "Start any timer and confirm it is running.",
        "Switch to a different timer tab; the previously running timer continues progressing in the background (its internal time keeps updating).",
        "Switch back to the original timer tab; its displayed time reflects the correct elapsed/remaining time (no reset, no unexpected pause).",
        "This behavior works for all timer modes: Pomodoro, Stopwatch, Countdown, Interval, Repeating."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the primary button styling so buttons use hex color #9E1C37 as the primary (default) button background color across the app (including light/dark themes), without editing files under the read-only `frontend/src/components/ui` path.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make the buttons hex code #9E1C37"
        ]
      },
      "acceptanceCriteria": [
        "Primary/action buttons render with background color #9E1C37 (verified via computed styles in the browser).",
        "Button text remains readable with sufficient contrast.",
        "No changes are made to any files in `frontend/src/components/ui`."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a new top-level \"Reminders\" tab/section to the main app navigation alongside the existing timer tabs, and implement a basic reminders UI that lets users create, view, edit, and delete reminders stored locally in the browser.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add a reminder tab in the website"
        ]
      },
      "acceptanceCriteria": [
        "The main tab bar includes a \"Reminders\" tab that switches to a Reminders view.",
        "Users can add a reminder with at least: title (text) and due date/time.",
        "Users can edit and delete existing reminders.",
        "Reminders persist across page reloads using localStorage."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a small, timer-adjacent enhancement in response to \"what else can you add?\": provide an optional, user-toggleable end-of-timer alert that triggers when a timer completes (e.g., in-app dialog/toast and/or a short sound), implemented entirely client-side.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "and what else can you add?"
        ]
      },
      "acceptanceCriteria": [
        "There is a user-facing toggle in Settings to enable/disable end-of-timer alerts.",
        "When enabled, completing a Countdown/Pomodoro segment/Interval cycle end/Repeating completion triggers an alert experience in the UI.",
        "When disabled, no alert is shown/played on completion.",
        "Implementation does not require backend changes or external services."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under `frontend/src/components/ui` (compose them instead).",
    "Backend must remain a single Motoko actor in `backend/main.mo`; only add backend logic if strictly necessary for the requested features.",
    "No external databases or third-party auth providers; local persistence should use browser storage where appropriate."
  ],
  "nonGoals": [
    "Multi-user reminders synced across devices/accounts.",
    "Push notifications, SMS/email reminders, or any external messaging integration.",
    "Real-time collaboration or chat features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}