{
  "kind": "build_request",
  "title": "Add minutes input for Interval Timer and improve publishing flow",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Interval Timer configuration UI to include a minutes input section for Interval A and Interval B (in addition to seconds), so users can set intervals using minutes+seconds while the timer continues to run using total seconds internally.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "add a minute section in the interval"
        ]
      },
      "acceptanceCriteria": [
        "Interval Timer shows separate numeric inputs for minutes and seconds for Interval A.",
        "Interval Timer shows separate numeric inputs for minutes and seconds for Interval B.",
        "Editing minutes/seconds updates the underlying stored interval duration correctly as total seconds.",
        "Existing stored interval settings (currently stored as seconds) continue to load without errors and display the correct minutes/seconds decomposition.",
        "While the timer is running, the minutes/seconds inputs remain disabled (consistent with current behavior of interval inputs)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Adjust Interval Timer validation limits to support minute-based entry (e.g., allow intervals longer than the current 600-second cap) and ensure clamping/validation remains consistent for both minutes and seconds fields.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "add a minute section in the interval"
        ]
      },
      "acceptanceCriteria": [
        "Seconds sub-field is clamped to 0–59.",
        "Minutes sub-field has a reasonable upper bound and prevents negative values.",
        "Total interval duration cannot be set to 0 seconds (must be at least 1 second overall).",
        "The displayed countdown (MM:SS or HH:MM:SS) remains correct for longer intervals."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve the in-app publishing guidance so the user can reliably “publish my website” from the existing Publish & Share sheet, including clearer copy for draft/preview vs public URL and a short checklist of the steps to go live.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "publish my website"
        ]
      },
      "acceptanceCriteria": [
        "Publish & Share sheet clearly distinguishes between the current preview/draft URL and the public URL that appears after going live.",
        "If the app is embedded in an iframe preview, the UI prominently warns that the shown URL is for preview and instructs the user to use the Live tab’s Go live button for a public URL.",
        "All user-facing text is in English and fits within the existing sheet layout without overflowing on mobile widths."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (Shadcn UI sources are read-only).",
    "Do not edit immutable hook bootstrap files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain single-actor in backend/main.mo; add backend changes only if strictly required (this request should be frontend-only)."
  ],
  "nonGoals": [
    "Adding server-side persistence or syncing timer settings across devices/users.",
    "Implementing custom domains, external hosting, or non-Internet Computer deployment steps.",
    "Adding third-party authentication beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [
      "Support minute-based interval configuration in the interval timer.",
      "Publish the app to a public production URL."
    ],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}