{
  "kind": "build_request",
  "title": "Auto-clear broken persisted background so the app loads without the error overlay",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When the app starts, detect if a persisted background in localStorage cannot be loaded (image/video URL unreachable/unsupported) and automatically clear the background so the app renders normally without a blocking background error state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "App currently errors due to missing background image URL; needs background cleared/reset so the app loads.",
          "duh",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "If localStorage contains a backgroundUrl/mediaType for an image or video that fails to load, the app clears the saved background and does not show the full-screen background error overlay on page load.",
        "If localStorage contains a YouTube background videoId that fails to initialize/load, the app clears the saved background and does not remain stuck in an error overlay on refresh.",
        "Clearing the broken persisted background removes the relevant persisted background entry so refreshing the page does not reintroduce the error."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update background persistence logic so transient runtime errors from BackgroundStage (e.g., image/video load failures) do not get persisted in a way that makes the app repeatedly boot into an error state after refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "The error shown in your image comes directly from the app’s code. It means the background image URL stored in your app is pointing to something that no longer exists.",
          "Quick fix: I can reset your background to blank so the app loads normally."
        ]
      },
      "acceptanceCriteria": [
        "Refreshing the page after a runtime background load error does not automatically restore the error overlay unless the user still has an active, valid background configured.",
        "Background settings (brightness, YouTube volume) continue to persist as before."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an in-app recovery action that is accessible even when the background error overlay is visible: provide a clear button in the overlay to reset/clear the current background and dismiss the error state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Want me to clear the background image now?",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "When the background error overlay is shown, it includes a visible control labeled in English (e.g., \"Clear background\") that clears the background and removes the overlay immediately.",
        "The recovery action works for image, video, and YouTube background error states."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components); compose them instead.",
    "Do not modify immutable hook files listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts[x], frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend remains single-actor; no new backend features are required for this fix."
  ],
  "nonGoals": [
    "Fixing the deployment/version rollback behavior (Version 14 vs Version 18) is out of scope for this request.",
    "Adding new background sources/providers beyond the existing file/URL/YouTube options is out of scope."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}