{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make background rendering clear & bright by removing global overlay and eliminating unintended visual filters",
  "requirements": [
    {
      "id": "REQ-29",
      "summary": "Remove/reduce the full-screen darkening/blur overlay over active backgrounds while keeping timer UI readable via existing UI surfaces and keeping the error screen distinct.",
      "acceptanceCriteria": [
        "When any background is active (image, video, or YouTube) and no error is displayed, the background is not visibly dimmed or blurred by a global overlay (i.e., it appears essentially as bright/clear as the source).",
        "Timer UI remains readable on top of the background using existing UI surfaces (e.g., cards/header/footer backgrounds) without re-introducing a noticeable full-screen dark overlay.",
        "When a background fails and the error screen is shown, the error screen remains readable and visually distinct from the background."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/backgrounds/BackgroundStage.tsx",
          "operation": "modify",
          "description": "Conditionally remove/disable the full-screen overlay layer when an active background (image/video/YouTube) is present and no error is being displayed; keep the error screen presentation readable and clearly separated from the background without relying on a global dimming overlay."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust global overlay styling tokens/utilities so the app no longer applies noticeable full-screen dimming/blur over active backgrounds (e.g., drive overlay opacity effectively to zero and avoid blur in normal background viewing) while preserving readability via existing card/surface styling."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Slightly strengthen existing UI surface readability (e.g., header/footer/tabs/visibility bar card translucency/backdrop settings) so timer controls remain readable over brighter backgrounds without reintroducing a full-screen overlay."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Ensure background media elements (image/video/YouTube) render without unintended opacity reductions, CSS filters, or layering artifacts so they match original media clarity.",
      "acceptanceCriteria": [
        "For video backgrounds, the `<video>` element renders at full opacity with no dimming filter applied, and fills the viewport (object-cover) without additional softening effects.",
        "For image backgrounds, the rendered background image appears at full opacity with no dimming filter applied, and fills the viewport (cover/center) without additional softening effects.",
        "For YouTube backgrounds, the iframe background appears without additional app-side dimming/blur layers affecting it (beyond what the YouTube player itself may do)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/backgrounds/BackgroundStage.tsx",
          "operation": "modify",
          "description": "Audit and enforce that the image/video/YouTube background layers render with no app-side opacity reductions or CSS filter/blur effects; ensure layering/z-index does not introduce any unintended dimming/softening artifacts over the media."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Audit and remove/neutralize any global CSS utilities affecting background media clarity (e.g., filter/opacity/blur on overlay utilities) so background layers render at full clarity and brightness."
        }
      ]
    }
  ]
}