{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "TickTaskTime rebrand + clearer App Market publishing instructions",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Rename the app to TickTaskTime in frontend branding, header name, and browser tab title.",
      "acceptanceCriteria": [
        "`frontend/src/branding.ts` exports `APP_NAME` set to exactly `TickTaskTime`.",
        "The header in `frontend/src/App.tsx` displays `TickTaskTime`.",
        "`frontend/index.html` `<title>` is updated to use the new name (and no longer shows `TickTask`).",
        "No remaining user-visible occurrences of `TickTask` appear in the UI chrome (header/tab title) after the change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/branding.ts",
          "operation": "modify",
          "description": "Update APP_NAME constant to exactly \"TickTaskTime\" so the header branding reflects the new app name."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the document <title> to use \"TickTaskTime\" and remove the old \"TickTask\" text so the browser tab title reflects the rename."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Rewrite the “Publish to the App Market” section in the Publish & Share sheet with clear, step-by-step instructions for publishing via Caffeine’s UI (no automation).",
      "acceptanceCriteria": [
        "`frontend/src/features/publishShare/PublishShareSheet.tsx` includes App Market publishing steps that explicitly reference using Caffeine’s UI (e.g., where to go in Caffeine after the app is Live) rather than a generic \"visit submission page\" instruction.",
        "The note clarifying this applies to Caffeine apps (not Wix) remains present and is still clearly worded in English.",
        "No new integrations, API calls, or external service dependencies are added as part of this change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/publishShare/PublishShareSheet.tsx",
          "operation": "modify",
          "description": "Revise the \"Publish to the App Market\" copy to be explicit, step-by-step, and centered on navigating Caffeine’s UI after the app is Live (e.g., where to find App Market/publishing within Caffeine and what information to provide). Keep the existing Caffeine-vs-Wix note. Do not add any new integrations or network calls. Use the existing shadcn-ui Sheet/Alert/Button structure already in this file to present the instructions; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}