{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Minutes+seconds Interval Timer inputs and clearer Publish & Share guidance",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add minutes+seconds inputs for Interval A and Interval B while continuing to store durations internally as total seconds.",
      "acceptanceCriteria": [
        "Interval Timer shows separate numeric inputs for minutes and seconds for Interval A.",
        "Interval Timer shows separate numeric inputs for minutes and seconds for Interval B.",
        "Editing minutes/seconds updates the underlying stored interval duration correctly as total seconds.",
        "Existing stored interval settings (currently stored as seconds) continue to load without errors and display the correct minutes/seconds decomposition.",
        "While the timer is running, the minutes/seconds inputs remain disabled (consistent with current behavior of interval inputs)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/timers/shared/MinutesSecondsInput.tsx",
          "operation": "create",
          "description": "Create a small composite input that renders two shadcn-ui Input-based numeric fields (via EditableNumberInput) for minutes and seconds, derives values from a total-seconds prop, and emits updated total seconds via callback. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/timers/interval/IntervalTimer.tsx",
          "operation": "modify",
          "description": "Replace the single seconds-only inputs for Interval A and Interval B with the new MinutesSecondsInput (minutes + seconds) while keeping settings.intervalA/settings.intervalB stored as total seconds; ensure the new inputs are disabled when isRunning is true. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update interval duration validation/clamping to support minute-based entry and longer intervals, with consistent limits across minutes/seconds fields and correct long countdown display.",
      "acceptanceCriteria": [
        "Seconds sub-field is clamped to 0–59.",
        "Minutes sub-field has a reasonable upper bound and prevents negative values.",
        "Total interval duration cannot be set to 0 seconds (must be at least 1 second overall).",
        "The displayed countdown (MM:SS or HH:MM:SS) remains correct for longer intervals."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/timers/shared/MinutesSecondsInput.tsx",
          "operation": "modify",
          "description": "Implement validation rules: clamp seconds to 0–59, clamp minutes to 0–(reasonable upper bound, e.g. 999), and enforce a minimum total duration of 1 second (auto-correct 0:00 to 0:01). Ensure composed total seconds is also clamped to the derived max. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/timers/interval/IntervalTimer.tsx",
          "operation": "modify",
          "description": "Remove the current 600-second max constraint for Interval A/B and rely on the minutes+seconds validation bounds; ensure labels and helper text (if any) reflect minute-based entry. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/timers/shared/timeFormat.ts",
          "operation": "modify",
          "description": "Review and adjust (if needed) formatting to ensure longer intervals still display correctly as MM:SS or HH:MM:SS; keep behavior consistent across timers."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Clarify Publish & Share sheet copy to distinguish preview/draft URL vs public URL and provide a concise go-live checklist, with a prominent embedded-preview warning.",
      "acceptanceCriteria": [
        "Publish & Share sheet clearly distinguishes between the current preview/draft URL and the public URL that appears after going live.",
        "If the app is embedded in an iframe preview, the UI prominently warns that the shown URL is for preview and instructs the user to use the Live tab’s Go live button for a public URL.",
        "All user-facing text is in English and fits within the existing sheet layout without overflowing on mobile widths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/publishShare/PublishShareSheet.tsx",
          "operation": "modify",
          "description": "Update the sheet UI/copy to (1) label the current URL as Preview/Draft (this session), (2) add a clearly labeled Public URL section explaining it will appear after going live (without fabricating a public link), (3) include a short step checklist to go live, and (4) show a prominent embedded-preview warning when useIsEmbeddedPreview() is true. Keep within existing layout and mobile-friendly text sizing; continue using existing shadcn-ui Sheet/Button patterns. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}